[
    {
        "sno": 313,
        "candidate": "Narendra Modi",
        "constituency": "VARANASI",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Post Graduate",
        "totalAssets": "Rs 3,02,06,889 ~ 3 Crore+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "VARANASI (UTTAR PRADESH)",
        "Profession": "Public Life, Political Activity",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/c5661014fbd65ad919773c2b32250a1ca5afb5e5.jpg",
        "news": [
            {
                "description": "The first meeting of the Council of Ministers during Prime Minister Narendra Modi's third term was held on Wednesday (August 28) at Sushma Swaraj Bhavan in Delhi. The meeting, chaired by PM Modi, lasted around five hours and fifty minutes. During the session, the Central Cabinet for Economic Affairs approved the establishment of 12 new industrial smart cities in 9 states. Spread across 10 states and aligned with six major corridors, these 12 industrial smart cities are expected to significantly boost manufacturing. Under the National Industrial Corridor Development Program, the government will invest ₹28,602 crore in these projects. According to Union Minister Ashwini Vaishnaw, these industrial smart cities will form a grand network along the Golden Quadrilateral, creating 1 million direct and 3 million indirect jobs. These projects are expected to generate an investment potential of ₹1.52 lakh crore, with a target of achieving ₹2 lakh crore in exports by 2030. The projects are anticipated to be completed by 2027, with five located near the Amritsar-Kolkata Industrial Corridor and two near the Delhi-Mumbai Industrial Corridor. One project each will be near the Visakhapatnam-Chennai, Hyderabad-Bengaluru, Hyderabad-Nagpur, and Chennai-Bengaluru Industrial Corridors. The 12th smart city will be in Haryana, though its exact location has not been disclosed. Notably, the Central Cabinet has approved eight infrastructure projects worth ₹2 lakh crore in the past three months. During the meeting, PM Modi reviewed the progress of the government's first 100-day agenda, with officials presenting reports on the work done. The focus was on schemes related to women, the poor, youth, and farmers. PM Modi emphasized the need for ministers and bureaucrats to focus on addressing the challenges faced by women and the underprivileged. Secretaries from various government departments attended the meeting. PM Modi urged quick responses on social media and emphasized maintaining the same pace of work seen over the last decade for the next five years. He promoted the slogan \"Perform, Reform, Transform, and Inform.\" The NDA government has set the goal of making India a developed nation by 2047 by addressing basic needs.",
                "link": "https://news.abplive.com/videos/news/india-pm-modi-launches-slogan-perform-reform-transform-and-inform-in-first-cabinet-meeting-of-third-term-1713402",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6914394497871399
                },
                "image": "",
                "summary": "During the session, the Central Cabinet for Economic Affairs approved the establishment of 12 new industrial smart cities in 9 states.\nSpread across 10 states and aligned with six major corridors, these 12 industrial smart cities are expected to significantly boost manufacturing.\nThese projects are expected to generate an investment potential of ₹1.52 lakh crore, with a target of achieving ₹2 lakh crore in exports by 2030.\nThe projects are anticipated to be completed by 2027, with five located near the Amritsar-Kolkata Industrial Corridor and two near the Delhi-Mumbai Industrial Corridor.\nNotably, the Central Cabinet has approved eight infrastructure projects worth ₹2 lakh crore in the past three months."
            },
            {
                "description": "The 35-foot statue fell just eight months after its unveiling by prime minister Narendra Modi",
                "link": "https://www.nationalheraldindia.com/national/maharashtra-panels-set-up-to-probe-collapse-of-shivaji-statue-build-new-one",
                "sentiment": {
                    "score": 0.8474656343460083
                },
                "image": "https://media.assettype.com/nationalherald%2F2024-08-27%2F7s7y4yin%2FPTI08_26_2024_000178B.jpg?rect=0%2C157%2C4179%2C2194&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
                "summary": "Maharashtra Government has set up a technical committee comprising engineers, IIT experts and Navy officials to probe reasons behind the collapse of Shivaji Maharaj statue at Malvan in coastal Konkan, an official said.\nA release issued by the chief minister’s office after midnight said the government has also constituted a committee to build a “grand statute befitting the stature” of the warrior king.\nThe decision was taken by CM Eknath Shinde, who chaired a meeting with senior ministers, bureaucrats and Navy officials at his official residence Varsha in South Mumbai Wednesday night, 28 August the release said.\nAn FIR has been registered against the contractor of the 35-foot statue which collapsed on Monday just eight months after it was unveiled by prime minister Narendra Modi on 4 December.\nThe FIR follows a complaint by the Public Works Department, which claims the statue's construction was of poor quality, and the nuts and bolts used in the structure were found to be rusted."
            },
            {
                "description": "Get latest articles and stories on India at LatestLY. Following a request from the Gujarat government, six columns of the Indian Army are conducting rescue operations in the worst-affected areas as the flood-like situation continues in parts of the state due to incessant rainfall.",
                "link": "https://www.latestly.com/agency-news/india-news-gujarat-rains-indian-army-deploys-6-columns-for-rescue-operations-6223641.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8823270797729492
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2024/08/ANI-20240829035205-588x441.jpg",
                "summary": "\"In response to the severe flooding in multiple districts, the Indian Army has swiftly mobilised its resources to support the ongoing relief efforts.\nFollowing a request from the Gujarat State Government, six columns of the Indian Army are undertaking rescue operations to the worst-affected areas to provide immediate Humanitarian Assistance and Disaster Relief (HADR),\" the Army said in a statement on Thursday.\nThe Gujarat government had requested six columns of Army assistance for urgent relief operations across several districts affected by severe flooding on Tuesday, according to a press release.\nInspector Manjit of the NDRF said that Dwarka has experienced heavy rainfall over the past two days.\nHeavy rainfall continued to lash parts of Gujarat on Wednesday, worsening the flood-like situation in Vadodara."
            },
            {
                "description": "Amid protests over the collapse of the Chhatrapati Shivaji Maharaj statue in the Rajkot Fort in Sindhudurg district, the Maharashtra government has announced the establishment of a joint technical committee comprising civil engineers, experts, representatives of IITs and Navy officers to investigate its reasons.",
                "link": "https://www.latestly.com/india/news/chhatrapati-shivaji-maharaj-statue-collapse-case-maharashtra-government-announces-formation-of-joint-technical-panel-to-probe-fall-of-shivaji-statue-in-rajkot-fort-6223610.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6355222463607788
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2024/08/IMG_2240-784x441.jpeg",
                "summary": "The decision was taken at a marathon meeting chaired by the Chief Minister with Ministers, senior bureaucrats and the Navy officers late Wednesday night.\nChhatrapati Shivaji Maharaj Statue Collapses in Malvan: 35-Foot Statue of Maratha King, Unveiled by PM Narendra Modi at Rajkot Fort, Falls Down (See Pics).\n\"The incident is unfortunate and the feelings of Chhatrapati Shivaji Maharaj devotees are quite intense.\nChhatrapati Shivaji Maharaj Statue Collapse: MVA Seeks FIR Against State-Centre; Calls for ‘Malvan Bandh’ on August 28.\nDeputy Chief Minister Devendra Fadnavis has appealed to the opposition not to politicise the issue but the Maha Vikas Aghadi has announced a protest at Hutatma Chowk on Sunday."
            },
            {
                "description": "Get latest articles and stories on Sports at LatestLY. On the occasion of the National Sports Day on Thursday, legendary hockey player Major Dhyan Chand's son, Olympian Ashok Kumar unveiled his father's statue in Jabalpur, Madhya Pradesh.",
                "link": "https://www.latestly.com/agency-news/sports-news-olympian-ashok-kumar-unveils-major-dyan-chands-statue-on-national-sports-day-6223631.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.606043815612793
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2024/08/ANI-20240829035116-588x441.jpg",
                "summary": "Jabalpur (Madhya Pradesh) [India], August 29 (ANI): On the occasion of the National Sports Day on Thursday, legendary hockey player Major Dhyan Chand's son, Olympian Ashok Kumar unveiled his father's statue in Jabalpur, Madhya Pradesh.\nHe was felicitated with the Padma Bhushan in 1956 and his birth anniversary on August 29, is celebrated as National Sports Day.\nAlso Read | National Sports Day of India 2024 Date and Significance: Know All About the Day That Marks the Birth Anniversary of Hockey Legend Major Dhyan Chand.\nAlso Read | National Sports Day 2024 Wishes and HD Images: WhatsApp Messages, Wallpapers and Quotes for Celebrating the Importance of Sports and Physical Fitness.\nThe children who come here will get a new direction and inspiration...\" Ashok Kumar said while speaking to ANI."
            },
            {
                "description": "Infosys cofounder and non-executive chairman Nandan Nilekani has said that startups built on top of India’s digital public infrastructure are...Infosys cofounder and non-executive chairman Nandan Nilekani has said that startups built on top of India’s digital public infrastructure are valued north of $100 Bn. “The estimate is that the market value of startups on top of India's DPI is about $100 Bn,” Nilekani said while speaking at the annual Global Fintech Festival 2024. He...CTA: Tap To Learn More",
                "link": "https://inc42.com/buzz/startups-built-atop-indias-digital-public-infra-pegged-at-100-bn-nandan-nilekani/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5560110211372375
                },
                "image": "https://inc42.com/cdn-cgi/image/quality=75/https://asset.inc42.com/2024/08/nilekani-fintech-social-.png",
                "summary": "Infosys cofounder and non-executive chairman Nandan Nilekani has said that startups built on top of India’s digital public infrastructure are valued north of $100 Bn.\n“The estimate is that the market value of startups on top of India’s DPI is about $100 Bn,” Nilekani said while speaking at the annual Global Fintech Festival 2024.\nSpeaking at the event, Nilekani also elaborated on a concept called “Finternet”, which he dubbed as the future of finance.\nUser-controlled assets, user content, NFTs (non fungible tokens), adjusted assets which are certified by somebody, registered assets like land, or regulated assets like financial products,” Nilekani added.\nAt the heart of all this is the burgeoning Indian fintech space, which has seen startups raise more than $28 Bn in funding between 2014 and 2023."
            },
            {
                "description": "Vadodara: As relentless rains continue to hit Gujarat, causing severe flooding in Vadodara, the Indian Army joined forces of rescue operations, providing ...",
                "link": "https://english.mathrubhumi.com/news/india/vadodara-floods-indian-army-rescue-operations-1.9854363",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5645195841789246
                },
                "image": "https://english.mathrubhumi.com/image/contentid/policy:1.9854364:1724902592/saving%20kid.jfif?$p=ae5bf39&f=16x9&w=1080&q=0.8",
                "summary": "Vadodara: As relentless rains continue to hit Gujarat, causing severe flooding in Vadodara, the Indian Army joined forces of rescue operations, providing critical relief to affected residents.\nTo advertise here, Contact Us The Golden Katar Division of the Indian Army has been tirelessly working in Vadodara, managing to save over 150 individuals from floodwaters.\nTheir persistent efforts have been met with gratitude from locals, who have been heard chanting ‘Zindabad’ in appreciation.\nDuring natural calamities and whenever needed, he always stands by Gujarat and the people of Gujarat, providing warmth and invaluable guidance,\" Patel further added.\nHeavy rainfall continued to lash in parts of Gujarat on Wednesday, worsening the flood-like situation in Vadodara."
            },
            {
                "description": "Heavy rains have wreaked havoc in Gujarat, leading to 28 fatalities and the evacuation of nearly 18,000 people. The IMD has issued red alerts for multiple districts, predicting more extreme weather.",
                "link": "https://www.indiatodayne.in/national/story/heavy-rains-claim-28-lives-in-gujarat-thousands-evacuated-1081442-2024-08-29",
                "sentiment": {
                    "label": "negative",
                    "score": 0.8768562078475952
                },
                "image": "https://cf-img-a-in.tosshub.com/lingo/itne/images/story/202408/66cfeee3b0047-heavy-rains-claim-28-lives-in-gujarat--thousands-evacuated-294538712-16x9.jpg",
                "summary": "Torrential rains pounding Gujarat for the past three days have resulted in at least 28 deaths, forcing authorities to evacuate nearly 18,000 people from flood-affected areas.\nThe India Meteorological Department (IMD) has issued a red alert for 11 districts, warning of extremely heavy rainfall.\nRed alerts have been issued for the Kachchh and Saurashtra regions, while 22 districts are under a yellow alert.\nPrime Minister Narendra Modi has reached out to Gujarat Chief Minister Bhupendra Patel, pledging central government support for relief efforts.\nFurther, 14 National Disaster Response Force (NDRF) platoons and 22 State Disaster Response Force (SDRF) platoons are supporting disaster management efforts."
            }
        ]
    },
    {
        "sno": 306,
        "candidate": "RajNath Singh",
        "constituency": "LUCKNOW",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Post Graduate",
        "totalAssets": "Rs 7,36,84,617 ~ 7 Crore+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "LUCKNOW (UTTAR PRADESH)",
        "Profession": "Minister Salary, Pension and Agriculture",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/57808bf191310d21204c0675651c02f27a0dbf2d.jpg",
        "news": [
            {
                "description": "The nuclear-powered ballistic missile submarine will be commissioned at a ship-building centre in the presence of Defence Minister Rajnath Singh and other security and military officials.",
                "link": "https://www.news9live.com/india/india-fortifies-its-nuclear-triad-ins-arighat-to-be-commissioned-today-key-features-2674571",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9331433773040771
                },
                "image": "https://images.news9live.com/wp-content/uploads/2024/08/INS-arighat.jpg",
                "summary": "New Delhi: In a big step towards further boosting its strategic deterrence capabilities, India is likely to commission its second nuclear-powered submarine INS Arighat on Thursday at a low-key event in Visakhapatnam.\nIndia’s first nuclear-powered submarine INS Arihant was commissioned in 2016.\nWhat are key features of INS Arighat INS Arighat is an upgraded version of INS Arihant, India’s first SSBN (Ship, Submersible, Ballistic, Nuclear).\nThe Indian Navy in October 2016 quietly commissioned into service the country’s first indigenous nuclear powered submarine INS Arihant which is capable of firing nuclear weapons.\nINS Arighat is powered by 83 MW pressurised light-water reactors at its core that ensure it can stay submerged for months on end."
            },
            {
                "description": "A shortlist of the biggest headlines, recommended stories, and a special collection of news items that you should check out.",
                "link": "https://www.hindustantimes.com/india-news/morning-briefing-india-to-commission-2nd-nuclear-submarine-today-kangana-ranauts-mess-dig-at-rahul-gandhi-and-more-101724900200697.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7717293500900269
                },
                "image": "",
                "summary": "After getting reprimanded by her party for her remarks on farmers protests, actress-turned-politician Kangana Ranaut fired a fresh salvo at the Leader of Opposition in the Lok Sabha Rahul Gandhi alleging the Congress MP is a “mess” and accused him of only “chasing a chair”.\nHe is a mess in his speeches, in his conduct,” Kangana Ranaut said to a TV channel in an interview.\nThe BJP MP from Mandi also attacked Rahul Gandhi for showing pictures of the Hindu God Lord Shiva during his speech in the Lok Sabha and said he “should be tested for drugs”.\nDig Deeper Entertainment Over the years, actor Vaani Kapoor has worked on diverse projects such as Shuddh Desi Romance, Befikre, War, Chandigarh Kare Aashiqui, Shamshera, and Khel Khel Mein.\nDig Deeper Lifestyle Nita Ambani never fails to rain blindingly beautiful couture looks."
            },
            {
                "description": "As part of his day-long visit, defence minister Rajnath Singh is scheduled to arrive in Visakhapatnam on August 29 (Thursday).",
                "link": "https://www.thehansindia.com/andhra-pradesh/rajnath-to-attend-a-programme-at-naval-base-today-903045",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9196274280548096
                },
                "image": "https://assets.thehansindia.com/h-upload/2024/08/29/1475435-rajnadh.jpg",
                "summary": "Visakhapatnam : As part of his day-long visit, defence minister Rajnath Singh is scheduled to arrive in Visakhapatnam on August 29 (Thursday).\nThis is the second time the defence minister is visiting Visakhapatnam after taking charge as the defence minister for the second consecutive term.\nAfter reaching the city, the defence minister is slated to proceed to Visakhapatnam naval base to take part in a programme at 12.45 noon.\nHe will proceed to INS Dega after the completion of the naval programme.\nEarlier, during his trip to the city, Rajnath Singh said that he looks forward to visiting Visakhapatnam and the sound of waves inspires him."
            },
            {
                "description": "Latest news updates: Catch all the news developments from around the world here",
                "link": "https://www.business-standard.com/india-news/live-news-updates-telegram-gujarat-rain-ins-arighat-defence-minister-rajnath-singh-kerala-hema-committee-pune-porsche-124082900102_1.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.807371199131012
                },
                "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-08/28/thumb/fitandfill/400X400/1724840422-3407.jpg",
                "summary": "Regarding this incident, the Chief Minister of Bengal, who is herself a woman, should have immediately taken cognisance and taken action against the culprits.\nAccording to IMD parameters, rainfall between 2.5 and 15.5 mm is considered 'light', 15.6 mm-64.4 mm 'moderate', 64.5-115.5 mm 'heavy', 115.6-204.4 mm 'very heavy' and more than 204.5 mm 'extremely heavy'.\nDoctor's rape-murder: Union WCD Minister criticises Bengal CM, urges her to focus on women's safety Lambasting West Bengal Chief for \"attempting to protect the culprits\" of the rape-murder of trainee doctor, Union Women and Child Development Minister Annapurna Devi on Thursday urged Mamata Banerjee to focus on women's safety.\nRegarding this incident, the Chief Minister of Bengal, who is herself a woman, should have immediately taken cognisance and taken action against the culprits.\nI have spoken against BJP, not medical students or protests, clarifies Mamata Banerjee Bengal Chief Minister Mamata Banerjee on Thursday said that disinformation is being spread regarding speech at a party event yesterday."
            },
            {
                "description": "With commissioning of INS Arighat, India will have a credible nuclear deterrent and strong second strike capability.",
                "link": "https://www.hindustantimes.com/india-news/indias-nuclear-missile-submarine-to-be-commissioned-by-rajnath-singh-today-101724896617152.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5232782959938049
                },
                "image": "",
                "summary": "India’s third SSBN, INS Aridaman or S4, is also set to be commissioned next year, followed shortly after by a fourth SSBN codenamed S-4*, the people said on condition of anonymity.\nIndia will now have two SSBNs – INS Arihant (S-2) and INS Arighat -- patrolling the high seas as a crucial part of the country’s nuclear triad and second-strike capability (due to its no-first-use policy).\nBoth the INS Arihant-class submarines are powered with an indigenous nuclear reactor and indigenous nuclear missile.\nSince INS Arihant was a technology demonstrator, INS Arighat has plugged all technological gaps and, in that context, is a more advanced version.\nSince India already has land-based nuclear missiles such as the Agni series, and air launch nuclear capability, the SSBN becomes the most potent weapon in the nuclear triad."
            },
            {
                "description": "India's 2nd nuclear missile submarine to be commissioned by Rajnath Singh today Hindustan TimesIn big step towards nuke triad, India set to commission 2nd nuclear-sub today The Times of IndiaIndia likely to commission second nuclear submarine INS Arighat on Thursday ANI NewsFirstUp: India to commission second nuclear submarine, Chilean foreign minister in Mumbai... The news today FirstpostMorning Brief: India To Get Second Nuclear Submarine Today, Rs 70,350-Crore Reliance-Disney Merger Approved, Bangladesh Begins Freeing Islamists From Jails Swarajya",
                "link": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOaUJaa3V4T3ZGZkNCenRmZTdTclF1Y0VDdEJzLVhoRlhHRkhoRnphWFpEWDh2dmJKeGVXbkxZMTBjV2dHUU94X2Z6ZXN6V3NBQWNLS1J1VmdBMU9sTjJxUVM4U09sSTM0NmJQeW5YMlJOMFpRWVBBcVVva3lnWDgweXB2SkVHSG5fNVB0eGVlYk5TeVRpZzlsYjRQN2tmaFVYRk5fc2ZkS3FXM2sxa055N0ZDaENPcWZ3VXNqT0cwdnhWNER3Y0ZsT3ZxQVFfVzJlSDZB0gHYAUFVX3lxTFBWT2M2N0pTY19WV04zOXBjT2JKZGM3REdsSS1jdjdUZ01kbldVZUpPUFJ3YkJna3R1TVE1R2RuOHhJWWtKbXJITnVKYVBXLXQtcDItUXpYdmczRzZpWjc3dDhnOHBCanlnSlMxX3prMTlEeXZSNldKT0xFMC1CQ3B4SmpFVW1VQ0U2Sy1nOW00WTdYWWMybHpHMWFrUzhOT1RSYkdfVjVBYmJRal9pTmoxS1lQQzlDQk5LSUZyeU9NaC0zVzFaSHJOYUk3YmlLUUNObUJ5aksxag?oc=5",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7899581789970398
                },
                "image": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
                "summary": ""
            },
            {
                "description": "India is poised to commission its second nuclear-powered submarine, INS Arighat, equipped with nuclear-tipped ballistic missiles. This 112-meter vessel will fortify the nation's strategic deterrence by joining INS Arihant. Defence Minister Rajnath Singh will oversee the ceremony in Visakhapatnam. This move marks a pivotal advancement in India's maritime security framework.",
                "link": "https://timesofindia.indiatimes.com/india/in-big-step-towards-nuke-triad-india-set-to-commission-2nd-n-sub-today/articleshow/112879589.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5156500935554504
                },
                "image": "https://static.toiimg.com/thumb/msid-112881535,width-1070,height-580,imgsize-1293322,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "8 morning habits that can help sharpen memory Lifestyle The New Seven Wonders of the World travel 10 easy dishes made with Murmura (Puffed Rice) Food 8 lesser-known parks in India to spot tigers travel Samantha to Malavika Mohanan: South actresses make a striking impression in black Entertainment Janmashtami 2024: How to make Instant Makhan without using malai in just 2 minutes Food 10 longest living pet dog breeds in the world Lifestyle ​10 animals that will disappear by 2030​ Lifestyle 8 golden rules for a happy and fulfilling life Lifestyle"
            },
            {
                "description": "In big step towards nuke triad, India set to commission 2nd nuclear-sub today The Times of IndiaIndia's 2nd nuclear missile submarine to be commissioned by Rajnath Singh today Hindustan TimesIndia likely to commission second nuclear submarine INS Arighat on Thursday ANI NewsFirstUp: India to commission second nuclear submarine, Chilean foreign minister in Mumbai... The news today FirstpostINS Arighat, India's 2nd nuclear-powered submarine, to be commissioned tomorrow India Today",
                "link": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNMWJJR0d6VzJ2UXgxVTNrempXZnVCNlFDMUd3OXBMNXN6eUVxVEdZRXBxT1c0MUpSSmVHZVg5dHBteGR4c1dFMHdsX2RPTzlxTDJHVkgxZVZCamlVUG9BdEVYbDhWTE1ZdXU1bXN3Q1hTdkN5bHEzTXd3c0NxUGZWM3JMbUZHZ0NUMzZnby1pZThLQ2c4WVlFeU5WUXRBNFhnN1FqWVRTZnlZRWozLW9KYk1fZkFmVE9jSmZwSVVfTzUwUzNoR3ZWTTlGTmlWQ0tHb3AxbQ?oc=5",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6353098750114441
                },
                "image": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
                "summary": ""
            },
            {
                "description": "India will now have two SSBNs – INS Arihant (S-2) and INS Arighat -- patrolling the high seas as a crucial part of the country’s nuclear triad and second-strike capability (due to its no-first-use policy).",
                "link": "https://www.hindustantimes.com/india-news/india-to-get-its-2nd-nuclear-submarine-101724870836535.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8081968426704407
                },
                "image": "",
                "summary": "While the defence ministry was tight-lipped about the classified project, HT has learnt that the 6,000-tonne INS Arighat is set to embark on a long-range patrol of the Indo-Pacific armed with 750-km range nuclear ballistic missiles K-15.\nIndia will now have two SSBNs – INS Arihant (S-2) and INS Arighat -- patrolling the high seas as a crucial part of the country’s nuclear triad and second-strike capability (due to its no-first-use policy).\nBoth the INS Arihant-class submarines are powered with an indigenous nuclear reactor and indigenous nuclear missile.\nSince INS Arihant was a technology demonstrator, INS Arighat has plugged all technological gaps and, in that context, is a more advanced version.\nSince India already has land-based nuclear missiles such as the Agni series, and air launch nuclear capability, the SSBN becomes the most potent weapon in the nuclear triad."
            }
        ]
    },
    {
        "candidate": "Rahul Gandhi",
        "constituency": "RAE BARELI",
        "party": "INC",
        "criminalCase": 18,
        "education": "Post Graduate",
        "totalAssets": "Rs 20,39,61,862 ~ 20 Crore+",
        "liabilities": "Rs 49,79,184 ~ 49 Lacs+",
        "details__constituency": "RAE BARELI (UTTAR PRADESH)",
        "Profession": "Member OF Parliament",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/1c5b0360e444ca24886c9afec53fa3dd7bd4affd.jpg",
        "news": [
            {
                "description": "'Bharat Dojo Yatra' soon.Congress MP Rahul Gandhi shared a video of himself from his martial art training days during the Bharat Jodo Nyay Yatra earlier this year.",
                "link": "https://in.mashable.com/culture/81343/rahul-gandhi-practices-jiu-jitsu-teases-bharat-dojo-yatra-on-national-sports-day",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8027040362358093
                }
            },
            {
                "description": "Leader of Opposition (LoP) in the Lok Sabha Rahul Gandhi on Thursday shared a video from the past edition of Bharat Jodo Yatra, in which he could be seen performing martial arts with fellow \"yatris\". He also announced the launch of 'Bharat Dojo Yatra' and also In a post on social media platform X, the Congress MP shared glimpses of him practising jiu-jitsu (self-defence martial art) every evening at a campsite, during the Bharat Jodo Yatra, held earlier this year. He said, \"Bharat Dojo Yatra is coming soon. Dojo broadly refers to a training hall or school for martial arts.\"\"During the Bharat Jodo Nyay Yatra, as we journeyed across thousands of kilometres, we had a daily routine of practising jiu-jitsu every evening at our campsite,\" he said, sharing a video of one of the martial arts sessions.In the video, the former Congress president could be seen practising sessions with children and also showcasing some techniques. \"What began as a simple way to stay fit quickly evolved into a community activity, bringing together fellow yatris and young martial arts students from the towns where we stayed. Our goal was to introduce these young minds to the beauty of the 'Gentle Art' - a harmonious blend of meditation, jiu-jitsu, Aikido, and non-violent conflict resolution techniques,\" he further stated.During the Bharat Jodo Nyay Yatra, as we journeyed across thousands of kilometers, we had a daily routine of practicing jiu-jitsu every evening at our campsite. What began as a simple way to stay fit quickly evolved into a community activity, bringing together fellow yatris and… pic.twitter.com/Zvmw78ShDX— Rahul Gandhi (@RahulGandhi) August 29, 2024\"We aimed to instil in them the value of transforming violence into gentleness, giving them the tools to build a more compassionate and safer society,\" he added.\"During the Bharat Jodo Nyay Yatra, as we journeyed across thousands of kilometers, we had a daily routine of practicing jiu-jitsu every evening at our campsite. What began as a simple way to stay fit quickly evolved into a community activity, bringing together fellow yatris and young martial arts students from the towns where we stayed.Gandhi further stated that on National Sports Day, he wants to inspire the new generation to take up the practice of the 'Gentle Art'.\"Our goal was to introduce these young minds to the beauty of the ‘Gentle Art’—a harmonious blend of meditation, jiu-jitsu, Aikido, and non-violent conflict resolution techniques. We aimed to instill in them the value of transforming violence into gentleness, giving them the tools to build a more compassionate and safer society. On this #NationalSportsDay, I want to share our experience with all of you, hoping to inspire some of you to take up the practice of the ‘Gentle Art’. P.S.: Bharat Dojo Yatra is coming soon,\" he said.Before the Lok Sabha Elections, Rahul Gandhi undertook the Bharat Jodo Yatra in two phases. The first padayatra took place from September 2022 to January 2023, covering Kanyakumari to Kashmir while the second edition commenced from Manipur and concluded in Mumbai.",
                "link": "https://news.abplive.com/news/india/rahul-gandhi-flaunt-his-jiu-jitsu-skills-in-bharat-jodo-yatra-viral-video-1713555",
                "sentiment": null
            },
            {
                "description": "Sharing glimpses of his jiu-jitsu, aikido and meditation practice that kept him fit and focused during the Bharat Jodo Nyay Yatra, Leader of Opposition Rahul Gandhi on 29 August — India's National Sports Day — announced a ‘Bharat Dojo Yatra’ ahead.",
                "link": "https://www.nationalheraldindia.com/national/rahul-gandhi-shares-video-of-martial-arts-training-hints-bharat-dojo-yatra-soon",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7686560750007629
                }
            },
            {
                "description": "A look at all the film returning to theatres in August 2024",
                "link": "https://www.ndtv.com/entertainment/rehnaa-hai-tere-dil-mein-to-tumbbad-films-re-releasing-in-theatres-this-august-6444727",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8856572508811951
                }
            },
            {
                "description": "Smriti Irani noted a change in Rahul Gandhi's politics, describing his actions as strategic, whether perceived as good, bad, or childish.",
                "link": "https://www.livemint.com/politics/news/smriti-irani-examines-how-rahul-gandhis-political-strategy-has-changed-when-he-wears-white-t-shirt-talks-caste-11724927235148.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7940987348556519
                }
            },
            {
                "description": "NEW DELHI, Aug 29: Congress leader Rahul Gandhi on Thursday shared a video of one of the martial arts sessions held at campsites of his east to west Bharat Jodo Nyay Yatra earlier this year and said a “Bharat Dojo Yatra” is coming soon. Dojo broadly refers to a training hall or school for martial arts. “During the Bharat Jodo Nyay Yatra, as we journeyed across thousands of kilometers, we had a daily routine of practicing Jiu-Jitsu every [...]The post ‘Bharat Dojo Yatra’ coming soon: Rahul shares video of martial arts session during Nyay Yatra appeared first on Daily Excelsior.",
                "link": "https://www.dailyexcelsior.com/bharat-dojo-yatra-coming-soon-rahul-shares-video-of-martial-arts-session-during-nyay-yatra/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8564729690551758
                }
            },
            {
                "description": "Madhya Pradesh Congress President Jitu Patwari on Thursday lashed out at the ruling BJP over a Government Railway Police (GRP) assault on a Dalit boy and his grandmother in Madhya Pradesh’s Katni district, a video of which went viral, sparking widespread outrage.",
                "link": "https://www.latestly.com/india/news/jitu-patwari-hits-out-at-bjp-over-madhya-pradesh-viral-video-congress-leader-says-bjp-is-anti-dalit-video-reveals-real-face-of-party-6224763.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6340846419334412
                }
            },
            {
                "description": "Leader of Opposition (LoP) in the Lok Sabha Rahul Gandhi on Thursday took to social media to announce the launch of 'Bharat Dojo Yatra' and also shared a video from the past edition of Bharat Jodo Yatra, in which he could be seen performing martial arts with fellow \"yatris\".",
                "link": "https://www.latestly.com/india/news/bharat-dojo-yatra-coming-soon-announces-rahul-gandhi-on-national-sports-day-2024-shows-off-jiu-jitsu-moves-in-new-video-6224802.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7490161657333374
                }
            },
            {
                "description": "Businessman and Infosys co-founder TV Mohandas Pai has voiced concerns over India's current tax policies, particularly those affecting the middle class. On August 28, Pai shared a chart on the social media platform X (formerly Twitter), highlighting discrepancies between individual incomes and corporate net incomes.\"Individual's income is more than corporate net income, corporates pay higher average rate. Income tax data for AY 23-24 gives full data,\" Pai commented in his post.Individuals income is more than corporate net income, corporates pay higher average rate. ⁦⁦@IncomeTaxIndia⁩ data for AY 23-24 gives full data ⁦@FinMinIndia⁩ ⁦@nsitharaman⁩ pic.twitter.com/NTjRKjNJqA— Mohandas Pai (@TVMohandasPai) August 28, 2024Pai has consistently criticised the government's tax policies over the past few months, raising issues related to the burden on the middle and salaried classes. He has frequently expressed his concerns on social media and in various media interviews.Earlier, Pai vehemently criticised the Rs 32,000 crore Goods and Services Tax (GST) demand issued to Infosys, calling it a prime example of 'tax terrorism.' He noted that Indian software service companies have been exporting for over 30 years, contributing to nearly 95 percent of export revenues. He emphasized that exports are exempt from GST. \"If this notice is accurate, it represents a blatant case of tax terrorism. It's outrageous,\" said Pai, who is also the Chairman of Aarin Capital, in an interview with Moneycontrol.\"The Finance Ministry should intervene immediately. Such tax terrorism severely affects investment into India,\" he added.On the other hand, Congress leader Rahul Gandhi has intensified his criticism of the government's tax policies, accusing the Centre of engaging in \"tax terrorism.\" Gandhi alleged that the government is placing an undue tax burden on the middle class to benefit corporate \"friends,\" according to a report by PTI.Gandhi questioned why the middle class, which already bears the brunt of high GST on goods, is subjected to increasing tax rates. He argued that this taxation strategy serves the interests of the wealthy while further burdening ordinary citizens.In response to the growing discourse, Revenue Secretary Sanjay Malhotra provided updates on the income tax department's recent activities. On August 21, Malhotra announced that nearly 4.98 crore income tax returns (ITRs) for AY 2024-25 had been processed within 15 days. He also noted that over 7.28 crore ITRs were filed by the July 31, 2024 deadline.Malhotra highlighted the significant growth in direct tax revenues over the last decade, which have risen from Rs 5.59 lakh crore to Rs 20 lakh crore. The tax-to-GDP ratio has also seen an increase from 5.6 per cent to 6 per cent during this period.As the debate over tax policies intensifies, the middle class remains at the forefront of this ongoing discourse.",
                "link": "https://news.abplive.com/business/tv-mohandas-pai-takes-potshot-at-govt-says-individuals-paying-more-taxes-than-all-indian-companies-combined-1713542",
                "sentiment": null
            }
        ]
    },
    {
        "candidate": "Om Birla",
        "constituency": "KOTA",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Post Graduate",
        "totalAssets": "Rs 10,62,06,645 ~ 10 Crore+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "KOTA (RAJASTHAN)",
        "Profession": "Member of Parliament, Kota Lok Sabha Parliamentary Constituency Kota (24) and Agricultural Work",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/78e98d22223294834b9214878a6d37d4f85b3dc2.jpg",
        "news": [
            {
                "description": "In the letter, he stated that only 13% of the Bills passed in the Rajya Sabha between 2014 and 2024 were referred to parliamentary committees for thorough scrutiny, indicating a sharp decline as compared to previous years",
                "link": "https://www.hindustantimes.com/india-news/tmcs-o-brien-expresses-concern-over-delay-in-reconstitution-of-parl-committees-101724830840367.html",
                "sentiment": {
                    "label": "negative",
                    "score": 0.5404661893844604
                }
            }
        ]
    },
    {
        "sno": 120,
        "candidate": "Amit Shah",
        "constituency": "GANDHINAGAR",
        "party": "BJP",
        "criminalCase": 3,
        "education": "12th Pass",
        "totalAssets": null,
        "liabilities": null,
        "details__constituency": "GANDHINAGAR (GUJARAT)",
        "Profession": "Social Work & Agriculture",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/3ea3cb7d48441c23c7a55ca3c1a40fb088268906.jpg",
        "news": [
            {
                "description": "In a significant development former Chief Minister of Jharkhand, Champai Soren has tendered his resignation from the Jharkhand Mukti Morcha (JMM) on Wednesday evening, August 28. Soren resignation has come on expected lines as the former heavy weight of JMM is all set to join the Bharatiya Janata Party (BJP) on August 30, boosting the latter chances to perform well in the tribal dominated Kolhan region in the upcoming state assembly elections. In a letter to the JMM president, Soren has expressed his disappointment over recent developments in the party terming it the prime reason behind his decision to part ways with the party. He further has cited that there is no appropriate forum in the party to express his grief hence he is tendering his resignation from prime membership and other positions. आज झारखंड मुक्ति मोर्चा की प्राथमिक सदस्यता एवं सभी पदों से त्याग-पत्र दिया। झारखंड के आदिवासियों, मूलवासियों, दलितों, पिछड़ों एवं आम लोगों के मुद्दों को लेकर हमारा संघर्ष जारी रहेगा। pic.twitter.com/ZpAmm2dopr — Champai Soren (@ChampaiSoren) August 28, 2024 Soren in the letter further has underscored that JMM has deviated from its path and the current working style and policies of the party has forced him to bid a goodbye. The former Chief Minister however asserted that he will continue his struggle on the issues of tribals, natives, Dalits, backward people and common masses. Soren resignation has arrived hours after the Chief Minister of Assam, Himata Biswa Sharma made startling claims that the former Chief Minister was being observed by the officials of the special branch of Jharkhand police. Read more at: Congress-JMM government of Jharkhand engaged spy behind Champai Soren; 2 detained in Delhi: Himanta Biswa Sarma...... The development attracted sharp reactions from another senior leader of the BJP, Babu Lal Marandi who claimed that there is information of state government misusing the police machinery to spy not only on opposition leaders and cabinet ministers but judges also. Marandi further demanded that the matter should be investigated by a committee headed by a sitting judge of High Court. हेमंत सोरेन, औरंगजेब के नक्शेकदम पर चलते हुए सत्ता के लिए नीचता की सारी पराकाष्ठा पार कर चुके हैं। औरंगजेब ने सत्ता के लिए अपने पिता शाहजहां को कैद में रखा था। ठीक उसी प्रकार हेमंत सोरेन भी अपने पितातुल्य चंपई सोरेन जी की जासूसी करा के अपनी सत्ता बचाए रखना चाहते हैं। जानकारी तो... pic.twitter.com/HpXedNXrVt — Office of Babulal Marandi (@babulalmarandi) August 28, 2024 Notably, Himanta Biswa Sarma in a social media post on Monday announced Soren’s decision to join the BJP. “Former Chief Minister of Jharkhand and a distinguished Adivasi (Janjati) leader of our country, Champai Soren, met Union Home Minister Amit Shah a short while ago, He will officially join the BJP on August 30 in Ranchi, said the Assam CM on X. It must be noted that the tribal dominated state of Jharkhand is all set to go for assembly polls in a few months’ time where a tough contest is expected between the ruling alliance led by JMM and the prime opposition BJP.",
                "link": "https://organiser.org/2024/08/29/253881/bharat/jharkhand-former-cm-champai-soren-tenders-resignation-from-jmm-set-to-join-bjp-before-crucial-state-assembly-polls/",
                "sentiment": null,
                "image": "https://organiser.org/wp-content/uploads/2024/02/untitled-21.webp",
                "summary": "In a significant development former Chief Minister of Jharkhand, Champai Soren has tendered his resignation from the Jharkhand Mukti Morcha (JMM) on Wednesday evening, August 28.\nSoren resignation has come on expected lines as the former heavy weight of JMM is all set to join the Bharatiya Janata Party (BJP) on August 30, boosting the latter chances to perform well in the tribal dominated Kolhan region in the upcoming state assembly elections.\nThe former Chief Minister however asserted that he will continue his struggle on the issues of tribals, natives, Dalits, backward people and common masses.\nSoren resignation has arrived hours after the Chief Minister of Assam, Himata Biswa Sharma made startling claims that the former Chief Minister was being observed by the officials of the special branch of Jharkhand police.\nNotably, Himanta Biswa Sarma in a social media post on Monday announced Soren’s decision to join the BJP."
            },
            {
                "description": "Congress MLA G S Patil has sparked a major controversy with his provocative comments during a protest organised by the Ahinda Union in Gajendragad.",
                "link": "https://www.thehansindia.com/karnataka/gadag-congress-mla-says-modi-will-face-bangladesh-like-situation-soon-903041",
                "sentiment": {
                    "label": "negative",
                    "score": 0.6473682522773743
                },
                "image": "https://assets.thehansindia.com/h-upload/2024/08/29/1475430-mla-g-s-patil.jpg",
                "summary": "Gadag: Congress MLA G S Patil has sparked a major controversy with his provocative comments during a protest organised by the Ahinda Union in Gajendragad.\nPatil’s statement was made during a speech in which he criticised the BJP and its leaders, Prime Minister Modi and Home Minister Amit Shah.\nJigajinagi criticised the intelligence and understanding of Congress leaders, accusing them of failing to contribute to the state’s development and misleading the public with false promises.\nThis incident is the latest in a series of similar controversial statements from Congress leaders in Karnataka.\nThere are at least three occasions when the Congress leaders have reference to the Bangladesh situation including that of Ivan D’Souza MLC from Congress party in Mangaluru"
            },
            {
                "description": "Top events today: BJP to hold CEC meeting on August 29 to discuss J-K and Haryana seats. RIL announces 47th virtual AGM on the same day. Kerala govt plans all-party meeting for landslide survivors' rehabilitation.",
                "link": "https://www.livemint.com/news/india/top-events-today-august-29-bjp-cec-meeting-j-k-seats-haryana-reliance-ind-47th-agm-wayanad-landslide-survivors-politics-11724892844207.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6321437954902649
                }
            },
            {
                "description": "The Indian Navy will commission its second nuclear submarine, INS Arighat, in Visakhapatnam today. Chile's Foreign Minister Alberto Van Klaveren is set to hold meetings with business leaders in Mumbai as part of his five-day visit to India. Here's what else will happen today",
                "link": "https://www.firstpost.com/explainers/firstup-india-to-commission-second-nuclear-submarine-chilean-foreign-minister-in-mumbai-the-news-today-13809145.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9070252180099487
                },
                "image": "https://images.firstpost.com/uploads/2024/08/reuters-chile-fm-2024-08-eab4793f532ed4fa10fd2ac5120bbeb1.jpg?im=FitAndFill=(1200,675)",
                "summary": "The Indian Navy will commission its second nuclear submarine, INS Arighat in Visakhapatnam.\nKarnataka High Court to hear complaints against CM Siddaramaiah in the alleged MUDA site allotment scam.\nDelhi High Court will hear the anticipatory bail plea of suspended IAS trainee officer Puja Khedkar.\nAdvertisement Here’s a glimpse of what will happen today Indian Navy to commission its second nuclear submarine The Indian Navy is set to commission its second nuclear submarine, INS Arighat, today.\nChile’s Foreign Minister to visit Mumbai Chile’s Minister of Foreign Affairs, Alberto Klaveren, is set to embark on a two-day visit to Mumbai today."
            }
        ]
    },
    {
        "sno": 28,
        "candidate": "Nitin Jairam Gadkari",
        "constituency": "NAGPUR",
        "party": "BJP",
        "criminalCase": 10,
        "education": "Doctorate",
        "totalAssets": "Rs 28,03,17,321 ~ 28 Crore+",
        "liabilities": "Rs 6,22,30,174 ~ 6 Crore+",
        "details__constituency": "NAGPUR (MAHARASHTRA)",
        "Profession": "Agriculture",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/16f475140824e7f76d64189b7cab058fb8b348e7.jpg",
        "news": [
            {
                "description": "Bhubaneswar: Union Road Transport and Highways Minister Nitin Gadkari Wednesday awarded Odisha as the best state in the country for road safety initiatives during the sixth edition of FICCI’s Road Safety Conclave held in New Delhi. Pradeep Kumar Mohanty, Joint Transport Commissioner (Road Safety), received the award on behalf of the state. While conferring the [...]",
                "link": "https://www.orissapost.com/best-state-award-to-odisha-for-road-safety-initiatives/",
                "sentiment": {
                    "label": "positive",
                    "score": 0.7218142747879028
                },
                "image": "https://www.orissapost.com/wp-content/uploads/2024/08/Lead-sta-scaled.jpeg",
                "summary": "Bhubaneswar: Union Road Transport and Highways Minister Nitin Gadkari Wednesday awarded Odisha as the best state in the country for road safety initiatives during the sixth edition of FICCI’s Road Safety Conclave held in New Delhi.\nPradeep Kumar Mohanty, Joint Transport Commissioner (Road Safety), received the award on behalf of the state.\nWhile conferring the award, Gadkari said that Odisha’s efforts in reducing road accidents have been highly appreciated, setting a benchmark for other states.\nGadkari acknowledged that driver training plays a crucial role in enhancing road safety, with Odisha’s ‘SuVahak’ initiative receiving widespread acclaim from road safety experts nationwide.\nCommenting on the prestigious achievement, State Transport Commissioner Amitabh Thakur said, “The Commerce and Transport department, along with the State Transport Authority, is working diligently towards reducing road accidents.” ARINDAM GANGULY, OP"
            },
            {
                "description": "Bhubaneswar: Odisha has been recognized as the best state in India for road safety initiatives. The award was presented by Union Minister for Road Transport and Highways, Nitin Gadkari, during the sixth edition of FICCI’s Road Safety Conclave held in New Delhi. Pradeep Kumar Mohanty, Joint Transport Commissioner (Road Safety), received the award on behalf [...]",
                "link": "https://orissadiary.com/odisha-gets-best-state-award-for-road-safety-initiatives/",
                "sentiment": {
                    "label": "positive",
                    "score": 0.9048742055892944
                },
                "image": "https://i0.wp.com/orissadiary.com/wp-content/uploads/2024/08/Odisha-gets-‘Best-State-Award-for-road-safety-initiatives.jpg.webp?fit=679%2C452&ssl=1",
                "summary": "Bhubaneswar: Odisha has been recognized as the best state in India for road safety initiatives.\nThe award was presented by Union Minister for Road Transport and Highways, Nitin Gadkari, during the sixth edition of FICCI’s Road Safety Conclave held in New Delhi.\nPradeep Kumar Mohanty, Joint Transport Commissioner (Road Safety), received the award on behalf of the state.\nHe acknowledged that driver training plays a crucial role in enhancing road safety, with Odisha’s ‘SuVahak’ initiative receiving widespread acclaim from road safety experts nationwide.\nHe emphasized the pivotal role of driver training and personality development in the state’s road safety initiatives, which have also created employment opportunities through government-supported programs."
            },
            {
                "description": "Need to name, shame guardians: Mantri on ‘brats’ behind wheels",
                "link": "https://timesofindia.indiatimes.com/india/need-to-name-shame-guardians-mantri-on-brats-behind-wheels/articleshow/112877881.cms",
                "sentiment": {
                    "label": "negative",
                    "score": 0.6188008785247803
                },
                "image": "https://static.toiimg.com/thumb/msid-112877924,width-1070,height-580,imgsize-2274201,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "8 morning habits that can help sharpen memory Lifestyle The New Seven Wonders of the World travel 10 easy dishes made with Murmura (Puffed Rice) Food 8 lesser-known parks in India to spot tigers travel Samantha to Malavika Mohanan: South actresses make a striking impression in black Entertainment Janmashtami 2024: How to make Instant Makhan without using malai in just 2 minutes Food 10 longest living pet dog breeds in the world Lifestyle ​10 animals that will disappear by 2030​ Lifestyle 8 golden rules for a happy and fulfilling life Lifestyle"
            },
            {
                "description": "India faces a significant challenge as road accidents claim more lives than wars and militancy. Road Transport Minister Nitin Gadkari highlighted the need for regular safety audits and improved project reports to address the issue. Collaborative efforts with IITs are essential for reducing accidents, which account for a 3% GDP loss.",
                "link": "https://economictimes.indiatimes.com/news/india/road-accidents-have-claimed-more-lives-than-wars-nitin-gadkari/articleshow/112876710.cms",
                "sentiment": {
                    "label": "negative",
                    "score": 0.5617693066596985
                },
                "image": "https://img.etimg.com/thumb/msid-112876703,width-1200,height-630,imgsize-111168,overlay-economictimes/photo.jpg",
                "summary": "Synopsis India faces a significant challenge as road accidents claim more lives than wars and militancy.\nRoad Transport Minister Nitin Gadkari highlighted the need for regular safety audits and improved project reports to address the issue.\nAccording to Gadkari, India accounts for 5 lakh accidents and 1.5 lakh deaths annually, while 3 lakh people are injured.\n(You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)\n...moreless (You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)"
            },
            {
                "description": "Miffed over ‘inadequate’ compensation, farmers alleged that their land was being forcibly acquired without their consent last week.",
                "link": "https://www.hindustantimes.com/cities/chandigarh-news/malerkotla-farmers-clash-with-police-over-land-acquisition-101724873826911.html",
                "sentiment": {
                    "label": "negative",
                    "score": 0.9073253870010376
                },
                "image": "",
                "summary": "Miffed over ‘inadequate’ compensation, farmers alleged that their land was being forcibly acquired without their consent last week.\n“The majority of the land required for the project in Malerkotla has already been acquired, an official said, pleading anonymity.\nLater in the evening, the district administration convened a meeting with the farmers and announced a 10-member committee to address the grievances.\nNow, we have formed a committee which includes revenue, district administration and police officials.\n“There is no law and order problem in the state over land acquisition for NHAI projects,” Mann said."
            },
            {
                "description": "Residents of Uttarkashi have flagged concerns with the BRO’s forest clearance application submitted to the Centre, for the widening of the Char Dham road.",
                "link": "https://www.hindustantimes.com/india-news/locals-protest-bro-s-green-nod-for-char-dham-road-widening-project-101724870664580.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7277856469154358
                },
                "image": "",
                "summary": "Residents of Uttarkashi have flagged concerns with the Border Roads Organisation’s forest clearance application submitted to Union Environment Ministry, for the widening of the Char Dham road through the Bhagirathi Eco-Sensitive Zone.\nOne of BRO’s forest clearance applications for the widening of NH-34 between KM 8 (Bhaironghati) to KM 29.300 (Jhalla) under the project , available on the ministry’s Parivesh website shows some these discrepancies.\nThey demanded an immediate cancellation of two forest clearance proposals in violation of the Supreme Court’s order and the committee’s recommendations.\nDetails available on Parivesh website suggests that ministry has not yet cleared the application for forest clearance.\nFirstly, the entire road widening project in the eco-sensitive zone is in violation of the Ravi Chopra committee’s findings and warnings."
            },
            {
                "description": "Bhubaneswar: Odisha has been recognized as the best state in India for road safety initiatives. The award was presented by Union Minister for Road Transport and Highways, Nitin Gadkari, during the sixth edition of FICCI’s Road Safety Conclave held in New Delhi. Pradeep Kumar Mohanty, Joint Transport Commissioner (Road Safety), received the award on [...]The post Odisha gets ‘Best State Award’ for road safety initiatives appeared first on Pragativadi | Odisha News, Breaking News Odisha, Latest Odisha News.",
                "link": "https://pragativadi.com/odisha-gets-best-state-award-for-road-safety-initiatives/",
                "sentiment": {
                    "label": "positive",
                    "score": 0.8320486545562744
                },
                "image": "https://pragativadi.com/core/uploads/2024/08/Odisha-gets-‘Best-State-Award-for-road-safety-initiatives.jpg",
                "summary": "Bhubaneswar: Odisha has been recognized as the best state in India for road safety initiatives.\nThe award was presented by Union Minister for Road Transport and Highways, Nitin Gadkari, during the sixth edition of FICCI’s Road Safety Conclave held in New Delhi.\nPradeep Kumar Mohanty, Joint Transport Commissioner (Road Safety), received the award on behalf of the state.\nHe acknowledged that driver training plays a crucial role in enhancing road safety, with Odisha’s ‘SuVahak’ initiative receiving widespread acclaim from road safety experts nationwide.\nCommenting on this prestigious achievement, State Transport Commissioner Amitabh Thakur stated, “The Commerce and Transport Department, along with the State Transport Authority, is working diligently towards reducing road accidents."
            },
            {
                "description": "New Delhi/Bhubaneswar: Odisha has been recognized as the best state in the country for road safety initiatives. The state has been felicitated at the sixth edition of FICCI’s Road Safety Conclave in New Delhi.The award was presented by Union Minister for Road Transport and Highways Nitin Gadkari at the conclave. Pradeep Kumar Mohanty, Joint Transport Commissioner (Road Safety), received the award on behalf of the state.Odisha's efforts in reducing road accidents have been highly appreciated, setting a benchmark for other states. Gadkari, while conferring the award, emphasized the importance of focusing on enforcement and road engineering.He acknowledged that driver training plays a crucial role in enhancing road safety. Odisha's 'SuVahak' initiative has widespread acclaim from road safety experts nationwide.The state has established four SuVahak training centers, providing state-funded training for drivers, which has become a model for zero-accident achievements, inspiring other states.In his address, the Union Minister highlighted the central government's commitment to reducing road accidents across the country. He urged all states to adopt modern technology to ensure transparency and efficiency in these measures. Additionally, he stressed the importance of maintaining proper road engineering to prevent accidents, particularly among the youth.Representing Odisha in the panel discussion, Mohanty detailed the state’s innovative strategies over the years, including the implementation of the Intelligent enforcement Management System (IEMS) and 'SuVahak' programme. He emphasized the pivotal role of driver training and personality development in the state’s road safety initiatives, which have also created employment opportunities through government-supported programmes.Furthermore, Mohanty provided insights into the state's initiatives such as 'Rakshak', 'Junior Rakshak', and the establishment of trauma care centers, all aimed at saving lives in road accidents.Commenting on this achievement, State Transport Commissioner Amitabh Thakur said, \"The Commerce and Transport Department, along with the State Transport Authority, is working diligently towards reducing road accidents. This award motivates us to continue our efforts. Based on the valuable suggestions from the Union Minister during the conclave, we will strive to further enhance our road safety measures.”",
                "link": "https://sambadenglish.com/latest-news/odisha-bags-best-state-award-for-road-safety-initiatives-6933811",
                "sentiment": {
                    "label": "positive",
                    "score": 0.9265639781951904
                },
                "image": "https://img-cdn.thepublive.com/fit-in/1200x675/sambad-english/media/media_files/HYoqg1fiI8VUPcF1ISo7.jpeg",
                "summary": "New Delhi/Bhubaneswar: Odisha has been recognized as the best state in the country for road safety initiatives.\nThe state has been felicitated at the sixth edition of FICCI’s Road Safety Conclave in New Delhi.\nPradeep Kumar Mohanty, Joint Transport Commissioner (Road Safety), received the award on behalf of the state.\nHe emphasized the pivotal role of driver training and personality development in the state’s road safety initiatives, which have also created employment opportunities through government-supported programmes.\nCommenting on this achievement, State Transport Commissioner Amitabh Thakur said, \"The Commerce and Transport Department, along with the State Transport Authority, is working diligently towards reducing road accidents."
            },
            {
                "description": "New Delhi: Union Minister Nitin Gadkari said on Wednesday that a satellite-based toll system would be introduced on the Indian highways which would ensure a seamless movement of traffic and reduce congestion. Speaking at a media event here, the Union Minister said that the satellite-based system would deduct tolls from vehicles based on the kilometres travelled and help root out instances of higher fees that result from multiple toll booths over short distances. Global Navigation Satellite System (GNSS) technology represents a major upgrade from the existing FASTag system. GNSS automatically calculates the distance travelled and deducts the appropriate toll fee. This ensures motorists pay only for the distance they have covered, leading to potential savings on every trip. The system will eliminate the need for traditional toll booths, easing traffic congestion and reducing travel time by eliminating long queues. The satellite-based system is being tested on the Bengaluru-Mysuru National Highway (NH-275) in Karnataka and the Panipat-Hisar National Highway (NH-709) in Haryana. Once approved, the GNSS toll collection system will be rolled out in phases, initially covering major highways that connect key cities. NHAI's subsidiary Indian Highways Management Company Limited (IHMCL) recently organised an international workshop to discuss the rolling out the Global Navigation Satellite System (GNSS) based Electronic Toll Collection in India. Union Minister for Road Transport and Highways Nitin Gadkari was the chief guest at the event attended by senior officials. Industry experts from the US and Europe attended the workshop and deliberated on various aspects related to the smooth implementation of the free-flow toll system based on GNSS technology in India. The current FASTag system in India is an electronic toll collection method that utilises Radio Frequency Identification (RFID) technology to streamline toll payments on highways. Introduced to alleviate traffic congestion and enhance efficiency, FASTag enables vehicles to pass through toll plazas without stopping for cash transactions. However, the GNSS technology is superior and would streamline the system further. (IANS)",
                "link": "https://sambadenglish.com/national-international-news/satellite-based-toll-system-on-highways-to-be-rolled-out-soon-6933785",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.644829511642456
                },
                "image": "https://img-cdn.thepublive.com/fit-in/1200x675/sambad-english/media/post_attachments/wp-content/uploads/2018/02/highway.jpg",
                "summary": "New Delhi: Union Minister Nitin Gadkari said on Wednesday that a satellite-based toll system would be introduced on the Indian highways which would ensure a seamless movement of traffic and reduce congestion.\nGlobal Navigation Satellite System (GNSS) technology represents a major upgrade from the existing FASTag system.\nThe satellite-based system is being tested on the Bengaluru-Mysuru National Highway (NH-275) in Karnataka and the Panipat-Hisar National Highway (NH-709) in Haryana.\nOnce approved, the GNSS toll collection system will be rolled out in phases, initially covering major highways that connect key cities.\nThe current FASTag system in India is an electronic toll collection method that utilises Radio Frequency Identification (RFID) technology to streamline toll payments on highways."
            }
        ]
    },
    {
        "sno": 182,
        "candidate": "Shivraj Singh Chouhan",
        "constituency": "VIDISHA",
        "party": "BJP",
        "criminalCase": 1,
        "education": "Post Graduate",
        "totalAssets": "Rs 8,98,52,874 ~ 8 Crore+",
        "liabilities": "Rs 64,11,905 ~ 64 Lacs+",
        "details__constituency": "VIDISHA (MADHYA PRADESH)",
        "Profession": "Salary as a MLA , Agriculture & Horticulture",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/1140d2a096b0337ef74cb7842c1475398feb6338.jpg",
        "news": [
            {
                "description": "The agriculture ministry will implement a farmers' grievance redressal system in Krishi Bhawan, overseen by minister Shivraj Singh Chouhan. The system aims to resolve issues related to central schemes via a dedicated phone line. Each grievance will get a unique reference number for tracking, ensuring timely resolution by the concerned departments.",
                "link": "https://timesofindia.indiatimes.com/india/govt-to-launch-farmers-grievance-redressal-helpline/articleshow/112881989.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8969159126281738
                },
                "image": "https://static.toiimg.com/thumb/msid-112882013,width-1070,height-580,imgsize-1429275,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "Vishwa Mohan is Senior Editor at The Times of India.\nHe writes on environment, climate change, agriculture, water resources and clean energy, tracking policy issues and climate diplomacy.\nHe has been covering Parliament since 2003 to see how politics shaped up domestic policy and India’s position at global platform.\nBefore switching over to explore sustainable development issues, Vishwa had covered internal security and investigative agencies for more than a decade."
            },
            {
                "description": "A similar demand was also raised by the Samyukta Kisan Morcha (SKM) which claimed that the soybean prices had dropped to a 10 year low",
                "link": "https://www.thehindu.com/news/national/madhya-pradesh/increase-soybean-msp-to-6000quintal-demands-digvijaya-singh-seeks-pms-intervention/article68578061.ece",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.545628547668457
                },
                "image": "https://th-i.thgim.com/public/incoming/ijvl33/article68142016.ece/alternates/LANDSCAPE_1200/10219_22_3_2024_14_36_31_1_DSC_3005_BPL.JPG",
                "summary": "Former Madhya Pradesh Chief Minister and senior Congress leader Digvijaya Singh on Wednesday demanded that the price of Soybean crop be increased to around ₹6,000 per quintal.\nThey have demanded that its minimum price should not be less than ₹6,000 per quintal considering today’s cost.\nThis is also the demand of 100% farmers of Madhya Pradesh, PM and CM should pay full attention to this,” Mr. Singh, a Rajya Sabha member, further said.\nClaiming that the prices have dropped to between ₹3,500 and ₹4,000 this year from last August’s ₹4,450 to ₹4,725 per quintal, the SKM demanded that the Union Government must intervene to increase them between ₹6,000 and ₹8,000 per quintal.\nThe Union Government has increased the Minimum Support Price (MSP) of soybean for the marketing season 2024-25 by ₹292 from ₹4,600 per quintal during the last season to ₹4,892 per quintal."
            },
            {
                "description": "Former Jharkhand CM Champai Soren met Union Home Minister Amit Shah and is set to join the BJP, along with his son, in Ranchi on Friday. With Soren onboard, the BJP aims to attract tribal votes. Union Minister Shivraj Singh Chouhan and Assam CM Himanta Biswa Sharma will attend the event.",
                "link": "https://economictimes.indiatimes.com/news/politics-and-nation/champai-drops-plan-to-float-party-to-join-bjp/articleshow/112846465.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8105059862136841
                },
                "image": "https://img.etimg.com/thumb/msid-112846480,width-1200,height-630,imgsize-9786,overlay-economictimes/photo.jpg",
                "summary": "Former Jharkhand chief minister Champai Soren met Union home minister Amit Shah on Monday night and is all set to join the BJP in Ranchi on Friday.\nSources told ET that the BJP's state leadership told the party that it is better for Champai Soren to join the party rather than launch his own party.\nIf he is joining the BJP, Champai Soren has asked for a ticket for his son Babulal Soren from Ghatshila assembly constituency for which the BJP has agreed.\n(You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)\n...moreless (You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)"
            },
            {
                "description": "Get latest articles and stories on India at LatestLY. Union Minister George Kurian has been elected unopposed to the Rajya Sabha seat from Madhya Pradesh.",
                "link": "https://www.latestly.com/agency-news/india-news-union-minister-george-kurian-elected-unopposed-as-rajya-sabha-member-from-madhya-pradesh-6220437.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8739843964576721
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2024/08/96-48-784x441.jpg",
                "summary": "Bhopal, August 27: Union Minister George Kurian has been elected unopposed to the Rajya Sabha seat from Madhya Pradesh.\nRajya Sabha By-Election 2024: Union MoS Ravneet Singh Bittu Elected Unopposed Member of House From Rajasthan in Bypoll.\n\"Congratulations to Union Minister of State George Kurian on being elected unopposed to the Rajya Sabha from Madhya Pradesh.\nState BJP chief VD Sharma also congratulated Kurian and wrote on X, \"On being elected unopposed as Rajya Sabha member from Madhya Pradesh, Union Minister of State George Kurian reached Madhya Pradesh Legislative Assembly and received the certificate.\nOne Rajya Sabha seat in Madhya Pradesh was vacant after Union Minister Jyotiraditya Scindia was elected as the Member of Parliament (MP) in Lok Sabha from Guna constituency in the recently concluded general elections 2024."
            },
            {
                "description": "New Delhi [India], August 27 (ANI): Kharif crop sowing is at its advanced stage with farmers in India having sown crops across 1,065.08 lakh hectares so far this year as against 1,044.85 lakh hectares in the same period last year. On a yearly basis, the sowing is about 1.93 per cent higher, according to the [...]",
                "link": "https://theprint.in/economy/kharif-sowing-exceeds-last-years-figures/2241012/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7689037322998047
                },
                "image": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20240827115726.jpg",
                "summary": "Commodity-wise, paddy, pulses, oilseeds, millets, and sugarcane sowing has been higher year-on-year.\nIn the pulses basket, arhar and moong were higher, while urad, kulthi, and moth bean were a tad lower.\nThe Department of Agriculture and Farmers’ Welfare has released the progress of area coverage under kharif crops as of August 23, 2024: India has three cropping seasons — Summer, Kharif, and Rabi.\nCrops produced between Rabi and Kharif are Summer crops.\nTraditionally, Indian agriculture (especially the Kharif area/output) is heavily reliant on the progression of monsoon rainfall."
            }
        ]
    },
    {
        "sno": 392,
        "candidate": "Manohar Lal",
        "constituency": "KARNAL",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Graduate",
        "totalAssets": "Rs 2,54,42,914 ~ 2 Crore+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "KARNAL (HARYANA)",
        "Profession": "Ex- Chief Minister of Haryana",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/40bcddbf786037269a20c81a495755445e06f947.jpg",
        "news": [
            {
                "description": "The Indian Navy will commission its second nuclear submarine, INS Arighat, in Visakhapatnam today. Chile's Foreign Minister Alberto Van Klaveren is set to hold meetings with business leaders in Mumbai as part of his five-day visit to India. Here's what else will happen today",
                "link": "https://www.firstpost.com/explainers/firstup-india-to-commission-second-nuclear-submarine-chilean-foreign-minister-in-mumbai-the-news-today-13809145.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9070252180099487
                },
                "image": "https://images.firstpost.com/uploads/2024/08/reuters-chile-fm-2024-08-eab4793f532ed4fa10fd2ac5120bbeb1.jpg?im=FitAndFill=(1200,675)",
                "summary": "The Indian Navy will commission its second nuclear submarine, INS Arighat in Visakhapatnam.\nKarnataka High Court to hear complaints against CM Siddaramaiah in the alleged MUDA site allotment scam.\nDelhi High Court will hear the anticipatory bail plea of suspended IAS trainee officer Puja Khedkar.\nAdvertisement Here’s a glimpse of what will happen today Indian Navy to commission its second nuclear submarine The Indian Navy is set to commission its second nuclear submarine, INS Arighat, today.\nChile’s Foreign Minister to visit Mumbai Chile’s Minister of Foreign Affairs, Alberto Klaveren, is set to embark on a two-day visit to Mumbai today."
            },
            {
                "description": "Resorting to a unique way to get connected with people at the grassroot and understand the voters' mood, Haryana Chief Minister Nayab Singh Saini on Wednesday rode a bullock cart to reach a public meeting venue during campaigning.",
                "link": "https://www.ndtv.com/india-news/haryana-chief-minister-rides-bullock-cart-to-reach-meeting-venue-during-campaigning-6440185",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8101900219917297
                },
                "image": "https://c.ndtvimg.com/2024-08/1r6556t_haryana-cm_625x300_29_August_24.jpeg",
                "summary": "\"The son of a poor farmer knows how to run the government as well as drive a bullock cart,\" Saini wrote on X while sharing the video of riding the bullock cart.\nWith state BJP President Mohan Lal Badoli sitting next to him, the Chief Minister held the rope of oxen and rode the bullock cart along with two local women.\nThe security of the Chief Minister was accompanying him.\n\"The aim of the Chief Minister to ride a bullock cart was to understand issues and problems of the commoners.\nSenior Congress leader and two-time chief minister Bhupinder Hooda is working hard to return to power amid the party's internal 'war of supremacy'."
            },
            {
                "description": "Haryana Assembly Polls: The Chief Electoral Officer of Haryana has issued a show cause notice to the BJP state president for immediate corrective action.",
                "link": "https://www.livemint.com/politics/news/haryana-assembly-polls-election-commission-issues-notice-to-bjp-for-featuring-child-in-poll-campaign-video-11724856323175.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8856825232505798
                }
            },
            {
                "description": "The BJP's Haryana unit challenges Congress to nominate a Dalit chief minister candidate, questioning their commitment to backward classes. The Congress responds, asserting their record of Dalit leadership and confidence in winning the upcoming Haryana polls. The BJP had requested the Election Commission to postpone the elections citing holidays around the polling date.",
                "link": "https://timesofindia.indiatimes.com/india/name-a-dalit-bjp-cong-spar-over-cm-face-in-haryana-amid-caste-census-debate/articleshow/112868568.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7722544074058533
                },
                "image": "https://static.toiimg.com/thumb/msid-112868639,width-1070,height-580,imgsize-46408,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "The TOI News Desk comprises a dedicated and tireless team of journalists who operate around the clock to deliver the most current and comprehensive news and updates to the readers of The Times of India worldwide.\nWith an unwavering commitment to excellence in journalism, our team is at the forefront of gathering, verifying, and presenting breaking news, in-depth analysis, and insightful reports on a wide range of topics.\nThe TOI News Desk is your trusted source for staying informed and connected to the ever-evolving global landscape, ensuring that our readers are equipped with the latest developments that matter most.\""
            },
            {
                "description": "Rocky Mittal says he has composed over 200 songs eulogising PM and over 20 about UP CM Yogi. Once appointed publicity adviser by Khattar, he had a fallout with BJP earlier this month.",
                "link": "https://theprint.in/politics/maaf-karna-rahul-mere-bhai-haryana-singer-who-bashed-congress-mp-wrote-paeans-to-modi-changes-tune/2241816/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8342878818511963
                },
                "image": "https://static.theprint.in/wp-content/uploads/2024/08/Rocky-Mittal-1-JCB.jpg",
                "summary": "Mittal, who once preferred to write his name as ‘Modi Bhakt singer Rocky Mittal’, was appointed publicity advisor by the then Haryana chief minister Manohar Lal Khattar in 2016.\nI was an Andh Bhakt (blind devotee) of Narendra Modi and whatever I did it was a result of my Andh Bhakti for Modi.\n‘Ram Rajya Jaisa Hoga, Narendra Modi Ka Raaj; Saccha Sapoot Hain Narendra Modi, Bharat Maa Ki Awaaz (Narendra Modi’s rule will be like Ram Rajya; Modi is a true son, the voice of Mother India)’ As for Yogi Adityanath, Mittal’s song lauds the UP chief minister’s drive against corruption.\nThis is the reason I made this song tendering apologies to Rahul,” Mittal told ThePrint.\nMittal said though he considered himself very close to Modi, he was never liked by the BJP dispensation in Haryana."
            },
            {
                "description": "Months after her victory in the Lok Sabha elections from Sirsa, the former Union Minister Selja has expressed her intention to run in the forthcoming assembly elections, stating her eagerness to serve in the state.",
                "link": "https://zeenews.india.com/india/name-selja-as-cm-candidate-to-show-sc-support-haryana-bjp-dares-rahul-gandhi-congress-ahead-of-assembly-elections-2784310.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5628435015678406
                },
                "image": "https://english.cdn.zeenews.com/sites/default/files/2024/08/28/1486949-selja.png",
                "summary": "The Haryana unit of ruling BJP on Wednesday dared Congress to declare Kumari Selja as its chief ministerial candidate for the state assembly polls, to prove how committed it is to the well-being of the SC community.\nThe state BJP also said they nominate Nayab Singh Saini, who belongs to the OBC category, a chief minister.\nSaini is also the BJP's chief ministerial face for the upcoming assembly elections, scheculed for October 1.\n\"The BJP has already nominated a chief minister from the backward class.\nLet them (Congress) declare Selja ji as the chief ministerial candidate from Haryana so that one can know how much of a well-wisher of the (SC) community they are,\" Haryana BJP posted on X in Hindi."
            }
        ]
    },
    {
        "sno": 109,
        "candidate": "H.D. Kumaraswamy",
        "constituency": "MANDYA",
        "party": "Janata Dal (Secular)",
        "criminalCase": 3,
        "education": "Graduate",
        "totalAssets": "Rs 2,17,23,28,789 ~ 217 Crore+",
        "liabilities": "Rs 82,18,06,608 ~ 82 Crore+",
        "details__constituency": "MANDYA (KARNATAKA)",
        "Profession": "Social Worker, Politician and Agriculturist",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/f0f6b4abe51c0bcc537f374e99008bc4a7ed7048.jpg",
        "news": [
            {
                "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI",
                "link": "https://www.theweek.in/wire-updates/national/2024/08/28/mds6-ka-governor-home-minister.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6519312262535095
                },
                "image": "https://www.theweek.in/content/dam/week/wire-updates/the-week-pti-wire-updates.jpg",
                "summary": "Speaking to reporters here, he said a tentative plan has been discussed regarding all the legislators meeting the President, taking into consideration the \"developments and decisions\" in the court.\nRegarding the eleven Bills that were sent back by the Governor, the Minister said: \"Let's see, the legal team is examining.\nIn case he is still not convinced, we will have to go to the President.\"\n\"Whether it should be done at the party level or by including INDI Alliance partners, the party high command will decide.\nWhen such is the case, the court will look into all these things and will decide on it,\" he said."
            }
        ]
    },
    {
        "sno": 457,
        "candidate": "Piyush Goyal",
        "constituency": "MUMBAI NORTH",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Graduate Professional",
        "totalAssets": "Rs 1,10,95,14,447 ~ 110 Crore+",
        "liabilities": "Rs 14,22,65,061 ~ 14 Crore+",
        "details__constituency": "MUMBAI NORTH (MAHARASHTRA)",
        "Profession": "Chartered Accountant, Presently Cabinet Minister In Government Of India",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/b63410d4948f92b4ee43c8ac0f6f5296db727430.jpg",
        "news": [
            {
                "description": "Similarly, in Tumakuru in Karnataka, Krishnapatnam in Andhra Pradesh, Nangal Chaudhary in Haryana, and Dadri, Greater Noida in Uttar Pradesh, the government's special purpose vehicle (SPV) is in the process of constructing the basic infrastructure like road connectivity, water and power supply",
                "link": "https://www.thehansindia.com/news/national/12-new-industrial-cities-approved-to-boost-mfg-903024",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9039087891578674
                },
                "image": "https://assets.thehansindia.com/h-upload/2024/08/29/1475414-nangal-chaudhary.jpg",
                "summary": "New Delhi: The government on Wednesday approved 12 new industrial cities in 10 states on the lines of Greater Noida in Uttar Pradesh and Dholera in Gujarat to boost domestic manufacturing with an estimated investment of Rs 28,602 crore.\nThe Cabinet \"has approved 12 new project proposals under the National Industrial Corridor Development Programme (NICDP) with an estimated investment of Rs 28,602 crore\", Union Minister Ashwini Vaishnaw said after the meeting.\nThese projects will create an investment potential of about Rs 1.52 lakh crore.\nThe decision followed the announcement by the government in the Budget for the development of 'plug and play' industrial parks in or near 100 cities in partnership with states and the private sector to boost manufacturing.\nTrunk infrastructure has been created in four cities -- Dholera (Gujarat), Auric (Maharashtra), Vikram Udyogpuri (Madhya Pradesh) and Krishnapatnam (Andhra Pradesh) and allotment of land plots is underway for the industry."
            },
            {
                "description": "Centre to spend Rs 28,602 cr on new projects under NICDP",
                "link": "https://www.thehansindia.com/news/national/12-new-smart-cities-to-boost-mfg-903010",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.785993218421936
                }
            },
            {
                "description": "Either a lot has transpired in the past few days, or maybe I’m overthinking things (that’d be very much in line with my personality).",
                "link": "https://www.hindustantimes.com/technology/amazon-and-flipkart-face-blinkit-zepto-conundrum-and-solving-telegram-s-chaos-101724875628527.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5014081597328186
                },
                "image": "https://images.hindustantimes.com/default/550x309.jpg",
                "summary": "Is it because quick commerce and their ~10-minute delivery promises are more attractive?\nThe Apple iPhone, Samsung Galaxy flagships and Sony PlayStation availability on Blinkit and Zepto was just a trailer.\nIndian tech company Noise says they clocked a 4x surge in sales on quick commerce platforms on Father’s Day, this summer.\nLAW For a while now, we’ve seen tech platforms get into regulatory crosshairs worldwide.\nPavel Durov, the CEO of popular messaging platform Telegram, was arrested at a French airport over the weekend."
            },
            {
                "description": "The cabinet committee on economic affairs has cleared the development of 12 new industrial cities with a total investment of Rs 28,600 crore. These cities will be spread across multiple states and are expected to generate around 10 lakh jobs. Basic infrastructure for these projects is aimed to be developed within three years.",
                "link": "https://timesofindia.indiatimes.com/india/at-28-6k-cr-govt-to-set-up-12-industrial-cities/articleshow/112878516.cms",
                "sentiment": {
                    "label": "positive",
                    "score": 0.6327144503593445
                },
                "image": "https://static.toiimg.com/thumb/msid-112878641,width-1070,height-580,imgsize-1150001,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "8 morning habits that can help sharpen memory Lifestyle The New Seven Wonders of the World travel 10 easy dishes made with Murmura (Puffed Rice) Food 8 lesser-known parks in India to spot tigers travel Samantha to Malavika Mohanan: South actresses make a striking impression in black Entertainment Janmashtami 2024: How to make Instant Makhan without using malai in just 2 minutes Food 10 longest living pet dog breeds in the world Lifestyle ​10 animals that will disappear by 2030​ Lifestyle 8 golden rules for a happy and fulfilling life Lifestyle"
            },
            {
                "description": "Project aimed at boosting domestic manufacturing New Delhi: The government on Wednesday approved 12 new industrial cities in 10 states on the lines of Greater Noida in Uttar Pradesh and Dholera in Gujarat to boost domestic manufacturing with an estimated investment of Rs 28,602 crore. These industrial areas will be in Khurpia in Uttarakhand, Rajpura-Patiala [...]The post Cabinet clears setting up of 12 industrial smart cities appeared first on The Navhind Times.",
                "link": "https://www.navhindtimes.in/2024/08/29/nationalnews/cabinet-clears-setting-up-of-12-industrial-smart-cities/",
                "sentiment": {
                    "label": "positive",
                    "score": 0.5145913362503052
                },
                "image": "",
                "summary": "The cabinet “has approved 12 new project proposals under the National Industrial Corridor Development Programme (NICDP) with an estimated investment of Rs 28,602 crore”, Union Minister Ashwini Vaishnaw said after the meeting.\nThe cities, he said, will be developed as greenfield smart cities of global standards, built ‘ahead of demand’ on the ‘plug-n-play’ and ‘walk-to-work’ concepts.\nThis approach ensures that the cities are equipped with advanced infrastructure that supports sustainable and efficient industrial operations.\nHailing the move, Prime Minister Narendra Modi posted on X, “The Cabinet has taken a very important decision of building 12 Industrial nodes/cities under National Industrial Corridor Development Programme.\nSimilarly, Zaheerabad in Telangana will be set up on 3,245 acres with an investment of Rs 2,361 crore."
            },
            {
                "description": "Western Railway will launch a 15-coach train from Borivali to Konkan, flagged off by Union Railway Minister Ashwini Vaishnaw on August 29.",
                "link": "https://www.hindustantimes.com/cities/mumbai-news/wr-to-flag-off-konkan-bound-train-from-borivali-today-101724872656345.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9267538785934448
                },
                "image": "https://images.hindustantimes.com/default/1600x900.jpg",
                "summary": "During the election campaign, the duo had announced one such train to be started for the Ganpati festival.\nAs a regular service, this 20-coach train will start from Bandra Terminus as a bi-weekly service till Madgaon.\nThe train will arrive and depart from Bandra Terminus and Madgaon and will have 13 stops at Borivali, Vasai Road, Bhiwandi Road, Panvel, Roha, Veer, Chiplun, Ratnagiri, Kankavli, Sindhudurg, Sawantwadi, Thivim, and Karmali.\nThe train will depart from Madgaon every Tuesday and Thursday at 7.40am and arrive at Bandra Terminus at 11.40 pm.\nIt will leave Bandra Terminus every Wednesday and Friday at 6.50 am and reach Madgaon at 10 pm, according to the railway notification."
            }
        ]
    },
    {
        "sno": 67,
        "candidate": "Dharmendra Pradhan",
        "constituency": "SAMBALPUR",
        "party": "BJP",
        "criminalCase": 5,
        "education": "Post Graduate",
        "totalAssets": "Rs 6,92,19,190 ~ 6 Crore+",
        "liabilities": "Rs 53,37,781 ~ 53 Lacs+",
        "details__constituency": "SAMBALPUR (ODISHA)",
        "Profession": "Minister of Education, Skill development & Enterpreneurship, Govt of India & Chairman & member, Board of Trustees, Odisha Research Centre(ORC) A public Charitable trust.",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/0a4bffa0f778ea3762ebed1050db250a8a61f098.jpg",
        "news": [
            {
                "description": "Himanta hits back at Didi with 'politics of failure' swipe",
                "link": "https://timesofindia.indiatimes.com/india/himanta-hits-back-at-didi-with-politics-of-failure-swipe/articleshow/112877466.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5756567120552063
                },
                "image": "https://static.toiimg.com/thumb/msid-112877469,width-1070,height-580,imgsize-915284,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "8 morning habits that can help sharpen memory Lifestyle The New Seven Wonders of the World travel 10 easy dishes made with Murmura (Puffed Rice) Food 8 lesser-known parks in India to spot tigers travel Samantha to Malavika Mohanan: South actresses make a striking impression in black Entertainment Janmashtami 2024: How to make Instant Makhan without using malai in just 2 minutes Food 10 longest living pet dog breeds in the world Lifestyle ​10 animals that will disappear by 2030​ Lifestyle 8 golden rules for a happy and fulfilling life Lifestyle"
            },
            {
                "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI",
                "link": "https://www.theweek.in/wire-updates/national/2024/08/28/ces24-od-rail-line-majhi.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6519312262535095
                }
            },
            {
                "description": "Get latest articles and stories on India at LatestLY. Odisha Chief Minister Mohan Charan Majhi on Wednesday thanked Prime Minister Narendra Modi and Railway Minister Ashwini Vaishnaw for sanctioning two new railway lines for the state.",
                "link": "https://www.latestly.com/agency-news/india-news-odisha-cm-pradhan-thank-modi-vaishnaw-for-two-new-railway-lines-6223087.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5199998617172241
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2018/03/default-img-02.jpg",
                "summary": "Bhubaneswar, Aug 28 (PTI) Odisha Chief Minister Mohan Charan Majhi on Wednesday thanked Prime Minister Narendra Modi and Railway Minister Ashwini Vaishnaw for sanctioning two new railway lines for the state.\n\"Under the guidance of the Prime Minister, the dream of Odisha is being fulfilled today through the development of Odisha's railway infrastructure.\nThe project will significantly contribute to Odisha's transport, tourism and business growth and further accelerate the economic progress of the state,\" Majhi said.\nThe new railway lines will improve passenger services, transport, and business operations.\nAdditionally, this development will boost tourism in Odisha, increase the demand for Sambaluri weaving and handicrafts, and strengthen the local economy,\" Pradhan said."
            }
        ]
    },
    {
        "sno": 61,
        "candidate": "Jitan Ram Manjhi",
        "constituency": "GAYA (SC)",
        "party": "Hindustani Awam Morcha (Secular)",
        "criminalCase": 6,
        "education": "Graduate",
        "totalAssets": "Rs 30,20,578 ~ 30 Lacs+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "GAYA (SC) (BIHAR)",
        "Profession": "Public Life and Political Activities",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/36b33749cfe74dc2bd781e6dfa0f2c7c859687cb.jpg"
    },
    {
        "sno": 441,
        "candidate": "Rajiv Ranjan Singh Alias Lalan Singh",
        "constituency": "MUNGER",
        "party": "JD(U)",
        "criminalCase": 0,
        "education": "Graduate",
        "totalAssets": "Rs 13,82,28,639 ~ 13 Crore+",
        "liabilities": "Rs 29,15,378 ~ 29 Lacs+",
        "details__constituency": "MUNGER (BIHAR)",
        "Profession": "Social Services",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/d1adbc9d5c8d8acad1b605b4658ccf87afc9faa4.jpg",
        "news": [
            {
                "description": "Assam Chief Minister Himanta Biswa Sarma criticized West Bengal counterpart Mamata Banerjee for allegedly inciting public unrest to conceal her own failures. Sarma shared a video where Banerjee warned that instability in West Bengal could affect other states, cautioning her to avoid divisive politics.",
                "link": "https://timesofindia.indiatimes.com/city/kolkata/if-bengal-burns-controversy-cm-mamata-banerjee-faces-heat-from-bjp-cms-and-ministers/articleshow/112882193.cms",
                "sentiment": {
                    "label": "negative",
                    "score": 0.5430388450622559
                },
                "image": "https://static.toiimg.com/thumb/msid-112882900,width-1070,height-580,imgsize-27186,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "News City News kolkata News 'If Bengal burns' controversy: CM Mamata Banerjee face backlash from BJP and CMs for threatening northeast, doctors 'If Bengal burns' controversy: CM Mamata Banerjee face backlash from BJP and CMs for threatening northeast, doctors Assam Chief Minister Himanta Biswa Sarma criticized West Bengal counterpart Mamata Banerjee for allegedly inciting public unrest to conceal her own failures.\nAssam chief minister Himanta Biswa Sarma criticized his West Bengal counterpart Mamata Banerjee on Wednesday for allegedly threatening Assam with potential unrest.\nIn the video, Banerjee emphasized that although Bangladesh and West Bengal share the same language and culture, they are two different entities, with West Bengal being part of India.\n'She can't bully, threaten us': Assam Minister Pijush Hazarika Assam Minister Pijush Hazarika sharply criticized Mamata Banerjee for her statement, \"If Bengal burns, so will Assam.\"\nIf you burn Bengal, Assam, North-East, Uttar Pradesh, Bihar, Jharkhand, Odisha and Delhi too shall burn!"
            }
        ]
    },
    {
        "candidate": "Sarbananda Sonowal",
        "constituency": "DIBRUGARH",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Graduate Professional",
        "totalAssets": null,
        "liabilities": null,
        "details__constituency": "DIBRUGARH (ASSAM)",
        "Profession": "Presently holding the post of Union Cabinet Minister, Govt of India",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/0c1edd44c62d3a4452052a53379c45270f6991eb.jpg",
        "news": [
            {
                "description": "The MoU facilitates the revision of the wage structure and addresses other service conditions, including pensionary benefits",
                "link": "https://www.thehansindia.com/andhra-pradesh/wage-negotiations-bwnc-ipa-ink-pact-903015",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8870161175727844
                },
                "image": "https://assets.thehansindia.com/h-upload/2024/08/29/1475403-ipa.jpg",
                "summary": "The MoU facilitates the revision of the wage structure and addresses other service conditions, including pensionary benefits.\nThe periodicity of the settlement is set for five years, from January 1, 2022 to December 31, 2026.\nThe new pay scales, effective from January 1, 2022, will be formulated according to existing practices.\nAlso, the six federations expressed their appreciation to Sarbananda Sonowal for his timely intervention and continuous guidance in resolving the protracted wage negotiations.\nIn Visakhapatnam, the federation representatives and employees of Visakhapatnam Port Authority expressed their gratitude towards the VPA management for successful completion of wage negotiations."
            },
            {
                "description": "New Delhi, Aug 28(PTI) The Ministry of Ports, Shipping and Waterways on Wednesday approved a wage structure revision for workers at 12 major ports, benefiting about 20,000 permanent employees. As per a memorandum of understanding (MoU) between the Bipartite Wage Negotiation Committee (BWNC) and the Indian Port Association (IPA), a fitment benefit of 8.5 per [...]",
                "link": "https://theprint.in/economy/shipping-ministry-approves-wage-structure-revision-for-workers-of-major-ports/2242687/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6928218603134155
                },
                "image": "https://static.theprint.in/wp-content/uploads/2023/06/theprint_default_image_new.jpg",
                "summary": "There are around 20,000 permanent port and dock workers employed across 12 major ports.\nIn an official statement, the ministry said the MoU facilitates the revision of the wage structure and addresses other service conditions, including pensionary benefits, it added.\n“The Union Minister of Ports, Shipping & Waterways Sarbananda Sonowal approves for Wage Structure Revision for Workers of Major Ports,” the statement said.\nThe six federations are All India Port and Dock Workers’ Federation, All India Port and Dock Workers Federation (workers), Water Transport Workers Federation of India, Indian National Port and Dock Workers Federation and Port, Dock and Waterfront Workers Federation of India.\nThe shipping ministry set up a Bipartite Wage Negotiations Committee, comprising representatives of port management and federations in March 2021."
            },
            {
                "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI",
                "link": "https://www.theweek.in/wire-updates/business/2024/08/28/del123-biz-ld-port-strike-sonowal.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6519312262535095
                }
            },
            {
                "description": "The workers signed an MoU with the Indian Ports Association, calling off an indefinite strike that would have disrupted operations at 12 major ports across India from 28 August.",
                "link": "https://www.livemint.com/industry/port-workers-strike-revised-wage-structure-indian-ports-authority-wage-negotiations-wages-major-indian-ports-11724853647151.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6789816617965698
                }
            },
            {
                "description": "The MoU facilitates the revision of the wage structure and addresses other service conditions, including pensionary benefits. It was agreed that the fitment benefit of 8.5% on the aggregate amount of basic pay as of December 31, 2021, plus 30% Variable Dearness Allowance (VDA) as of January 1, 2022, shall be granted.",
                "link": "https://economictimes.indiatimes.com/industry/transportation/shipping-/-transport/wage-negotiations-with-port-workers-to-complete-in-a-fortnight/articleshow/112871708.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7949602603912354
                },
                "image": "https://img.etimg.com/thumb/msid-112871696,width-1200,height-630,imgsize-55070,overlay-economictimes/photo.jpg",
                "summary": "Workers at India’s 12 Major Ports agreed to call of their planned stir after the centre agreed to undertake wage revisions.\nAn agreement was signed between the Bipartite Wage Negotiation Committee (BWNC) and the Indian Port Association (IPA).\n(You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)\nSubscribe to The Economic Times Prime and read the ET ePaper online.\n...moreless (You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)"
            },
            {
                "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI",
                "link": "https://www.theweek.in/wire-updates/national/2024/08/28/cal39-as-assembly-accord.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6519312262535095
                }
            },
            {
                "description": "The Ministry of Ports, Shipping and Waterways has approved a new wage structure for workers at major ports, stopping an indefinite strike. The agreement includes an 8.5% fitment benefit and additional allowances. The periodicity of the settlement is from January 1, 2022, to December 31, 2026, with a review set for 2027.",
                "link": "https://economictimes.indiatimes.com/industry/transportation/shipping-/-transport/shipping-ministry-approves-wage-structure-revision-for-workers-of-major-ports/articleshow/112871021.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8025636672973633
                },
                "image": "https://img.etimg.com/thumb/msid-112871080,width-1200,height-630,imgsize-55070,overlay-economictimes/photo.jpg",
                "summary": "Synopsis The Ministry of Ports, Shipping and Waterways has approved a new wage structure for workers at major ports, stopping an indefinite strike.\nThe Ministry of Ports, Shipping and Waterways has approved wage structure revision for workers at major ports, an official statement said on Wednesday.\nThe six federations are All India Port and Dock Workers' Federation, All India Port and Dock Workers Federation (workers), Water Transport Workers Federation of India, Indian National Port and Dock Workers Federation and Port, Dock and Waterfront Workers Federation of India.\n(You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)\n...moreless (You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)"
            },
            {
                "description": "Get latest articles and stories on India at LatestLY. The assembly on Wednesday witnessed a noisy scene over implementation of the Assam Accord with the opposition accusing the government of not doing enough to execute the agreement.",
                "link": "https://www.latestly.com/agency-news/india-news-noisy-scene-in-assembly-over-assam-accord-implementation-6222683.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7167543172836304
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2018/03/default-img-01.jpg",
                "summary": "Guwahati, Aug 28 (PTI) The assembly on Wednesday witnessed a noisy scene over implementation of the Assam Accord with the opposition accusing the government of not doing enough to execute the agreement.\nSpeaking on the Justice Biplab Kumar Sarma committee report, Bora said some advocates have voiced their objections pointing towards legal issues.\nSeveral clauses of the Assam Accord are still being implemented, the minister said.\nHe told the House that so far 30,113 foreigners have been \"pushed back\" since the signing of the Assam Accord in 1985.\nThe Assam Accord was signed in 1985 after a six-year-long violent anti-foreigner movement."
            },
            {
                "description": "The results are a boost to the BJP in the Upper House where no single party since 1988-1990 has had an upper hand.",
                "link": "https://www.thequint.com/news/india/rajya-sabha-bjp-and-allies-win-11-of-12-seats-uncontested-gain-simple-majority-in-upper-house",
                "sentiment": {
                    "label": "positive",
                    "score": 0.739798367023468
                },
                "image": "https://images.thequint.com/thequint%2F2024-08-28%2F1oxmobl0%2FUntitled%20design%20(56).jpg",
                "summary": "The results of the Rajya Sabha elections to 12 seats have been announced with all the candidates getting elected unopposed.\nThe results propelled the NDA to a simple majority in the Rajya Sabha for the first time since coming to power in 2014.\nTo win a Rajya Sabha seat, a candidate should get the required number of votes, which is called the quotient.\nof Rajya Sabha seats for which elections are being held + 1) + 1 However, since these were by-polls the quotient for each seat is calculated individually.\nIn Telangana, the Rajya Sabha seat which went to the polls was held by the BRS."
            }
        ]
    },
    {
        "candidate": "Kinjarapu Ram Mohan Naidu",
        "constituency": "SRIKAKULAM",
        "party": "TDP",
        "criminalCase": 4,
        "education": "Post Graduate",
        "totalAssets": "Rs 23,30,73,561 ~ 23 Crore+",
        "liabilities": "Rs 2,98,63,859 ~ 2 Crore+",
        "details__constituency": "SRIKAKULAM (ANDHRA PRADESH)",
        "Profession": "Public Representative",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/caa46bb2fb7d5e38494155c4173776bfb8e834d1.jpg",
        "news": [
            {
                "description": "Coimbatore, in spite of having an international airport has very few direct connectivity to international destinations. Due to these tourists and passenger ...",
                "link": "https://english.mathrubhumi.com/news/money/coimbatore-airport-kgf-urges-ministry-international-flights-1.9852311",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.515088677406311
                },
                "image": "https://english.mathrubhumi.com/image/contentid/policy:1.9852343:1724857707/banner2_3.jpg?$p=dd5b402&f=16x9&w=1080&q=0.8",
                "summary": "Coimbatore, in spite of having an international airport has very few direct connectivity to international destinations.\nIn an open letter to the minister Kinjarapu Ram Mohan Naidu, the KGF has urged the ministry to include Coimbatore airport as ‘point of call' in the Bilateral Air Services Agreement (BASA) and in the ASEAN BASA.\nAs Coimbatore is not the point of call, international airlines will not get the rights to operate direct flights to and from Coimbatore.\nThe current agreement benefits six metropolitan cities and 18 tier-II cities, allowing an unlimited number of international flights by foreign carriers.\nHowever, as Coimbatore is not a ‘point of call’, these carriers are unable to get rights to operate from Coimbatore,” the letter noted."
            }
        ]
    },
    {
        "candidate": "Ashwini Vaishnaw",
        "news": [
            {
                "description": "The first meeting of the Council of Ministers during Prime Minister Narendra Modi's third term was held on Wednesday (August 28) at Sushma Swaraj Bhavan in Delhi. The meeting, chaired by PM Modi, lasted around five hours and fifty minutes. During the session, the Central Cabinet for Economic Affairs approved the establishment of 12 new industrial smart cities in 9 states. Spread across 10 states and aligned with six major corridors, these 12 industrial smart cities are expected to significantly boost manufacturing. Under the National Industrial Corridor Development Program, the government will invest ₹28,602 crore in these projects. According to Union Minister Ashwini Vaishnaw, these industrial smart cities will form a grand network along the Golden Quadrilateral, creating 1 million direct and 3 million indirect jobs. These projects are expected to generate an investment potential of ₹1.52 lakh crore, with a target of achieving ₹2 lakh crore in exports by 2030. The projects are anticipated to be completed by 2027, with five located near the Amritsar-Kolkata Industrial Corridor and two near the Delhi-Mumbai Industrial Corridor. One project each will be near the Visakhapatnam-Chennai, Hyderabad-Bengaluru, Hyderabad-Nagpur, and Chennai-Bengaluru Industrial Corridors. The 12th smart city will be in Haryana, though its exact location has not been disclosed. Notably, the Central Cabinet has approved eight infrastructure projects worth ₹2 lakh crore in the past three months. During the meeting, PM Modi reviewed the progress of the government's first 100-day agenda, with officials presenting reports on the work done. The focus was on schemes related to women, the poor, youth, and farmers. PM Modi emphasized the need for ministers and bureaucrats to focus on addressing the challenges faced by women and the underprivileged. Secretaries from various government departments attended the meeting. PM Modi urged quick responses on social media and emphasized maintaining the same pace of work seen over the last decade for the next five years. He promoted the slogan \"Perform, Reform, Transform, and Inform.\" The NDA government has set the goal of making India a developed nation by 2047 by addressing basic needs.",
                "link": "https://news.abplive.com/videos/news/india-pm-modi-launches-slogan-perform-reform-transform-and-inform-in-first-cabinet-meeting-of-third-term-1713402",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6914394497871399
                },
                "image": "",
                "summary": "During the session, the Central Cabinet for Economic Affairs approved the establishment of 12 new industrial smart cities in 9 states.\nSpread across 10 states and aligned with six major corridors, these 12 industrial smart cities are expected to significantly boost manufacturing.\nThese projects are expected to generate an investment potential of ₹1.52 lakh crore, with a target of achieving ₹2 lakh crore in exports by 2030.\nThe projects are anticipated to be completed by 2027, with five located near the Amritsar-Kolkata Industrial Corridor and two near the Delhi-Mumbai Industrial Corridor.\nNotably, the Central Cabinet has approved eight infrastructure projects worth ₹2 lakh crore in the past three months."
            },
            {
                "description": "Infosys cofounder and non-executive chairman Nandan Nilekani has said that startups built on top of India’s digital public infrastructure are...Infosys cofounder and non-executive chairman Nandan Nilekani has said that startups built on top of India’s digital public infrastructure are valued north of $100 Bn. “The estimate is that the market value of startups on top of India's DPI is about $100 Bn,” Nilekani said while speaking at the annual Global Fintech Festival 2024. He...CTA: Tap To Learn More",
                "link": "https://inc42.com/buzz/startups-built-atop-indias-digital-public-infra-pegged-at-100-bn-nandan-nilekani/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5560110211372375
                },
                "image": "https://inc42.com/cdn-cgi/image/quality=75/https://asset.inc42.com/2024/08/nilekani-fintech-social-.png",
                "summary": "Infosys cofounder and non-executive chairman Nandan Nilekani has said that startups built on top of India’s digital public infrastructure are valued north of $100 Bn.\n“The estimate is that the market value of startups on top of India’s DPI is about $100 Bn,” Nilekani said while speaking at the annual Global Fintech Festival 2024.\nSpeaking at the event, Nilekani also elaborated on a concept called “Finternet”, which he dubbed as the future of finance.\nUser-controlled assets, user content, NFTs (non fungible tokens), adjusted assets which are certified by somebody, registered assets like land, or regulated assets like financial products,” Nilekani added.\nAt the heart of all this is the burgeoning Indian fintech space, which has seen startups raise more than $28 Bn in funding between 2014 and 2023."
            },
            {
                "description": "Similarly, in Tumakuru in Karnataka, Krishnapatnam in Andhra Pradesh, Nangal Chaudhary in Haryana, and Dadri, Greater Noida in Uttar Pradesh, the government's special purpose vehicle (SPV) is in the process of constructing the basic infrastructure like road connectivity, water and power supply",
                "link": "https://www.thehansindia.com/news/national/12-new-industrial-cities-approved-to-boost-mfg-903024",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9039087891578674
                },
                "image": "https://assets.thehansindia.com/h-upload/2024/08/29/1475414-nangal-chaudhary.jpg",
                "summary": "New Delhi: The government on Wednesday approved 12 new industrial cities in 10 states on the lines of Greater Noida in Uttar Pradesh and Dholera in Gujarat to boost domestic manufacturing with an estimated investment of Rs 28,602 crore.\nThe Cabinet \"has approved 12 new project proposals under the National Industrial Corridor Development Programme (NICDP) with an estimated investment of Rs 28,602 crore\", Union Minister Ashwini Vaishnaw said after the meeting.\nThese projects will create an investment potential of about Rs 1.52 lakh crore.\nThe decision followed the announcement by the government in the Budget for the development of 'plug and play' industrial parks in or near 100 cities in partnership with states and the private sector to boost manufacturing.\nTrunk infrastructure has been created in four cities -- Dholera (Gujarat), Auric (Maharashtra), Vikram Udyogpuri (Madhya Pradesh) and Krishnapatnam (Andhra Pradesh) and allotment of land plots is underway for the industry."
            },
            {
                "description": "The Union Cabinet, led by PM Narendra Modi, approved the rollout of 730 new private FM radio channels across India, including 19 new private FM stations in Odisha. These will be established in Puri, Bhadrak, Balasore, Baripada, Berhampur, and Sambalpur. This initiative aims to fulfil the unmet demand for local content and employment opportunities while promoting regional languages and cultures.",
                "link": "https://odishatv.in/news/odisha/centre-approves-license-for-19-new-private-fm-stations-in-odisha-242732",
                "sentiment": {
                    "label": "positive",
                    "score": 0.6338537335395813
                },
                "image": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/recent_photo_1719728587.jpg",
                "summary": "The Union Cabinet, chaired by PM Narendra Modi on Wednesday approved the rollout of 730 FM radio channels in 234 cities and towns including 19 new private FM stations in Odisha.\nThis will fulfill the unmet demand for FM radio in these cities/towns and also bring new/local content in the mother tongue, apart from creating new employment opportunities and boosting local dialect and culture and ‘vocal for local’ initiatives.\nPM Modi’s decision to extend the Private FM Radio will also greatly enhance access to diverse and local content.\nThis move is set to boost creativity, promote local languages, and celebrate regional cultures, thereby enriching the media landscape across the country.\n“The FM radio rollout will fulfill the unmet demand in new cities and towns, which remain uncovered by the private FM radio broadcasting, and bring new and local content in the mother tongue,” said the government."
            },
            {
                "description": "Centre to spend Rs 28,602 cr on new projects under NICDP",
                "link": "https://www.thehansindia.com/news/national/12-new-smart-cities-to-boost-mfg-903010",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.785993218421936
                }
            },
            {
                "description": "Bhubaneswar: The Cabinet Committee on Economic Affairs (CCEA), chaired by Prime Minister Narendra Modi, approved three mega railway projects with an estimated cost of Rs 6456 crore. They include two new railway lines and one multi-tracking project covering four states including Odisha. The 138 km railway line will connect Bargarh Road and Nuapada Road and [...]",
                "link": "https://orissadiary.com/union-cabinet-approves-rs-2926-crore-railway-projects-for-western-odisha/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6850770115852356
                },
                "image": "https://i0.wp.com/orissadiary.com/wp-content/uploads/2024/06/GPXyEk2XQAAEBOk.png?fit=680%2C383&ssl=1",
                "summary": "Bhubaneswar: The Cabinet Committee on Economic Affairs (CCEA), chaired by Prime Minister Narendra Modi, approved three mega railway projects with an estimated cost of Rs 6456 crore.\nPM Modi has also approved Rs 1360 crore for the double railway line from Sundargarh’s Sardega to Chhattisgarh’s Bhalumuda.\nSpeaking to the media, Railways Minister Ashwini Vaishnaw informed, “Two of the most crucial railway projects of Odisha have been approved today.\nIt was our dream project for years, the railway line from Bargarh to Nuapada.\nThe ambitious railway line will pass through Padmapur, thereby benefitting the people there.” Earlier, Vaishnaw had also informed that the government aims to complete the projects within 4.5-5 years."
            },
            {
                "description": "The cabinet committee on economic affairs has cleared the development of 12 new industrial cities with a total investment of Rs 28,600 crore. These cities will be spread across multiple states and are expected to generate around 10 lakh jobs. Basic infrastructure for these projects is aimed to be developed within three years.",
                "link": "https://timesofindia.indiatimes.com/india/at-28-6k-cr-govt-to-set-up-12-industrial-cities/articleshow/112878516.cms",
                "sentiment": {
                    "label": "positive",
                    "score": 0.6327144503593445
                },
                "image": "https://static.toiimg.com/thumb/msid-112878641,width-1070,height-580,imgsize-1150001,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "8 morning habits that can help sharpen memory Lifestyle The New Seven Wonders of the World travel 10 easy dishes made with Murmura (Puffed Rice) Food 8 lesser-known parks in India to spot tigers travel Samantha to Malavika Mohanan: South actresses make a striking impression in black Entertainment Janmashtami 2024: How to make Instant Makhan without using malai in just 2 minutes Food 10 longest living pet dog breeds in the world Lifestyle ​10 animals that will disappear by 2030​ Lifestyle 8 golden rules for a happy and fulfilling life Lifestyle"
            }
        ]
    },
    {
        "candidate": "Jyotiraditya Scindia",
        "constituency": "GUNA",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Post Graduate",
        "totalAssets": "Rs 4,24,74,94,078 ~ 424 Crore+",
        "liabilities": "Rs 48,24,000 ~ 48 Lacs+",
        "details__constituency": "GUNA (MADHYA PRADESH)",
        "Profession": "Member of Parliament",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/8c7b6da734cac06d0190844a012ce4333989b791.jpg",
        "news": [
            {
                "description": "Industry conclave: The Madhya Pradesh government on attracted a total investment of ₹8,000 crore at Industry Conclave. The total investment includes ₹3,500 crore from Adani group",
                "link": "https://www.livemint.com/companies/news/mp-regional-investors-meet-govt-attracts-rs-8k-crore-investment-at-industry-conclave-adani-group-to-invest-3-5k-crore-11724899388295.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7579807043075562
                }
            },
            {
                "description": "Investors from more than 15 Indian states, including Uttar Pradesh, Rajasthan, Delhi, Maharashtra, Tamil Nadu, and Gujarat, also took part in the conclave.",
                "link": "https://www.hindustantimes.com/business/3rd-regional-industry-conclave-in-gwalior-spurs-13-000-crore-in-investments-101724865443961.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8289073705673218
                },
                "image": "",
                "summary": "Investors from more than 15 Indian states, including Uttar Pradesh, Rajasthan, Delhi, Maharashtra, Tamil Nadu, and Gujarat, also took part in the conclave.\nDelivering the opening remarks, Raghwendra Kumar Singh, Principal Secretary of the Department of Industrial Policy and Investment Promotion, emphasised the state's industrial growth under the leadership of the Hon'ble Chief Minister.\nHe noted that the \"Invest MP Summit roadshows are expected to generate over 48,300 jobs and attract investments exceeding ₹17,000 crore.\"\nSanjay Shukla, Principal Secretary of the Mineral Resources Department, and Sanjay Dubey, Principal Secretary of the Department of Science & Technology, also presented on the state’s vast mineral resources and the burgeoning IT sector, respectively.\nThe event attracted investments worth ₹8,000 crore from large industries, with the potential to create 35,000 jobs."
            },
            {
                "description": "Gwalior, Aug 28 (PTI) The Madhya Pradesh government’s regional industry conclave on Wednesday attracted investment proposals totalling Rs 8,000 crore across various sectors, including Rs 3,500 crore by Adani Group. Besides, Reliance is planning to invest in renewable gas and compressed biogas projects in the state. Addressing the conclave, Madhya Pradesh Chief Minister Mohan Yadav [...]",
                "link": "https://theprint.in/economy/industry-conclave-mp-govt-attracts-rs-8k-cr-investment-adani-group-to-invest-rs-3500-cr/2242894/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.695603609085083
                },
                "image": "https://static.theprint.in/wp-content/uploads/2023/06/theprint_default_image_new.jpg",
                "summary": "He said, “Under the leadership of Prime Minister Narendra Modi, India is the fifth largest economy in the world.\nThe event here attracted investments from large industries totalling Rs 8,000 crore across various sectors, with expected employment generation of 35,000 and over 2,500 MSMEs expressed intent to invest Rs 5,000 crore, an official said.\nThe announcement was made by Adani Ports and Special Economic Zone Ltd (APSEZ) MD Karan Adani at the Gwalior Regional Industry Conclave.\nAddressing the conclave, Madhya Pradesh Assembly Speaker Narendra Singh Tomar said that under the leadership of Prime Minister Narendra Modi, India has become the fifth-largest economy.\nBy hosting the Regional Conclave in Gwalior, our Chief Minister has significantly empowered and renewed the resolve of its citizens”."
            },
            {
                "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI",
                "link": "https://www.theweek.in/wire-updates/business/2024/08/28/dcm116-biz-mp-industry-conclave.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6519312262535095
                },
                "image": "https://www.theweek.in/content/dam/week/wire-updates/the-week-pti-wire-updates.jpg",
                "summary": "Gwalior, Aug 28 (PTI) The Madhya Pradesh government's regional industry conclave on Wednesday attracted investment proposals totalling Rs 8,000 crore across various sectors, including Rs 3,500 crore by Adani Group.\nAddressing the conclave, Madhya Pradesh Chief Minister Mohan Yadav outlined the government's vision and initiatives to promote investment, innovation, and sustainable development in the state.\nThe event here attracted investments from large industries totalling Rs 8,000 crore across various sectors, with expected employment generation of 35,000 and over 2,500 MSMEs expressed intent to invest Rs 5,000 crore, an official said.\nThe announcement was made by Adani Ports and Special Economic Zone Ltd (APSEZ) MD Karan Adani at the Gwalior Regional Industry Conclave.\nAddressing the conclave, Madhya Pradesh Assembly Speaker Narendra Singh Tomar said that under the leadership of Prime Minister Narendra Modi, India has become the fifth-largest economy."
            },
            {
                "description": "Madhya Pradesh's industry conclave draws Rs 8,000 crore investment with Adani Group pledging Rs 3,500 crore. Plans for industrial parks and renewable projects announced.",
                "link": "https://www.goodreturns.in/news/mp-govt-attracts-8k-cr-investment-adani-group-3500-cr-011-1373013.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6254944205284119
                },
                "image": "https://www.goodreturns.in/img/2024/08/investment-1724862981278-1200x675-ft.jpg",
                "summary": "Business -Swati Nair The Madhya Pradesh government's regional industry conclave on Wednesday saw investment proposals amounting to Rs 8,000 crore across various sectors.\nMadhya Pradesh Chief Minister Mohan Yadav highlighted the state's vision for investment and sustainable development.\nInvestment Proposals and Employment Generation The event attracted investments from large industries totalling Rs 8,000 crore across various sectors.\nAdditionally, over 2,500 MSMEs expressed their intent to invest Rs 5,000 crore, according to an official.\nNew Industrial Parks and Infrastructure Development The Madhya Pradesh Industrial Development Corporation (MPIDC) will open four new industrial parks under its Gwalior Regional Office."
            },
            {
                "description": "Get latest articles and stories on Latest News at LatestLY. The Madhya Pradesh government's regional industry conclave on Wednesday attracted investment proposals totalling Rs 8,000 crore across various sectors, including Rs 3,500 crore by Adani Group.",
                "link": "https://www.latestly.com/agency-news/latest-news-industry-conclave-mp-govt-attracts-rs-8k-cr-investment-adani-group-to-invest-rs-3500-cr-6223089.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7758334279060364
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2020/10/news-default-img-784x441.jpg",
                "summary": "Gwalior, Aug 28 (PTI) The Madhya Pradesh government's regional industry conclave on Wednesday attracted investment proposals totalling Rs 8,000 crore across various sectors, including Rs 3,500 crore by Adani Group.\nAddressing the conclave, Madhya Pradesh Chief Minister Mohan Yadav outlined the government's vision and initiatives to promote investment, innovation, and sustainable development in the state.\nThe event here attracted investments from large industries totalling Rs 8,000 crore across various sectors, with expected employment generation of 35,000 and over 2,500 MSMEs expressed intent to invest Rs 5,000 crore, an official said.\nAddressing the conclave, Madhya Pradesh Assembly Speaker Narendra Singh Tomar said that under the leadership of Prime Minister Narendra Modi, India has become the fifth-largest economy.\nBy hosting the Regional Conclave in Gwalior, our Chief Minister has significantly empowered and renewed the resolve of its citizens\"."
            },
            {
                "description": "In a post on X, office of Jyotiraditya Scindia wrote, 'Gwalior has always been a pioneer in the service of animals, especially Gau-seva. To further strengthen this effort, Chief Minister Mohan Yadav ji and Scindia ji flagged off Pashu Raksha Vaahan today.'",
                "link": "https://www.latestly.com/agency-news/india-news-mp-cm-mohan-yadav-scindia-flag-off-pashu-seva-rath-to-provide-health-services-to-animals-in-gwalior-6222163.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6420270800590515
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2024/08/2-619859784-1-784x441.jpg",
                "summary": "Gwalior, August 28: Madhya Pradesh Chief Minister Mohan Yadav and Union Minister Jyotiraditya Scindia flagged off 'Pashu Seva Rath' to provide health services to animals in Gwalior on Wednesday.\nTo further strengthen this effort, Chief Minister Mohan Yadav ji and Scindia ji flagged off Pashu Raksha Vaahan today.\"\nMadhya Pradesh Budget 2024-25 Largest in Fiscal History, Says CM Mohan Yadav; Congress Accuses Government of Not Keeping Poll Promises (Watch Video).\nCM Yadav, Union Minister Scindia, Madhya Pradesh Assembly Speaker Narendra Singh Tomar along with other state ministers, inaugurated the Regional Industry Conclave.\nMadhya Pradesh CM Mohan Yadav Approves Several Proposals Including ‘e-Vidhan’ and Purchase of Aircraft for State Government."
            }
        ]
    },
    {
        "candidate": "Bhupender Yadav",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Graduate Professional",
        "totalAssets": "Rs 2,32,36,037 ~ 2 Crore+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "ALWAR (RAJASTHAN)",
        "Profession": "Public Life, Political Activity",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/d9d01e0677b1c8ca1fb12995df3f3be133b50ef4.jpg",
        "news": [
            {
                "description": "The Congress spokesperson wrote in a letter to Environment Minister Bhupender Yadav that the EAC had pointed out that the location of the project was not based on environmental considerations",
                "link": "https://www.thehindu.com/news/national/environment-ignored-in-considering-sites-for-nicobar-infrastructure-project-jairam-ramesh/article68578457.ece",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.6958921551704407
                },
                "image": "https://th-i.thgim.com/public/incoming/em9gn0/article66081444.ece/alternates/LANDSCAPE_1200/vbk-stock-skp--01_Jairam_Ramesh_25_10_Delhi.jpg",
                "summary": "The Environment Ministry’s go-ahead to the ₹72,000 crore infrastructure project in the Nicobar islands had not considered the “least environmentally destructive” site at Campbell Bay.\nThis despite an Expert Appraisal Committee (EAC) pointing out that the project location had been chosen purely on technical and financial criteria and not on environmental ones, Congress spokesperson and Rajya Sabha MP Jairam Ramesh wrote in a letter to Environment Minister Bhupender Yadav.\nThis was after Mr. Yadav, earlier this week, wrote a detailed letter in response to the Congress spokesperson’s letter, where he raised a slew of concerns around the Environment Ministry’s approval of the project.\nThe project comprises a port, airport and township in Nicobar Islands.\nMoreover, the bulk of the project was “commercial” and there was thus little reason to keep the report of the High Powered Committee confidential on the grounds that the project had strategic and defence imperatives, Mr. Ramesh added."
            },
            {
                "description": "An adult male tiger, ST-2303, has traveled from Sariska reserve to Jhabua forest, 125km away, causing concern among forest officials about potential village threats. The dense forest and the tiger's elusive behavior complicate efforts to capture it. Authorities are working on relocating the tiger back to its original habitat in Sariska.",
                "link": "https://timesofindia.indiatimes.com/city/gurgaon/tiger-tiger-hunting-right-11-days-gone-st-2303-at-home-in-jhabua/articleshow/112852059.cms",
                "sentiment": {
                    "label": "negative",
                    "score": 0.5309259295463562
                },
                "image": "https://static.toiimg.com/thumb/msid-112852108,width-1070,height-580,imgsize-1757935,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
                "summary": "8 morning habits that can help sharpen memory Lifestyle The New Seven Wonders of the World travel 10 easy dishes made with Murmura (Puffed Rice) Food 8 lesser-known parks in India to spot tigers travel Samantha to Malavika Mohanan: South actresses make a striking impression in black Entertainment Janmashtami 2024: How to make Instant Makhan without using malai in just 2 minutes Food 10 longest living pet dog breeds in the world Lifestyle ​10 animals that will disappear by 2030​ Lifestyle 8 golden rules for a happy and fulfilling life Lifestyle"
            },
            {
                "description": "Jairam Ramesh has responded to environment minister Bhupender Yadav’s letter which said that no objections were raised by the tribals against the project.",
                "link": "https://www.hindustantimes.com/india-news/cong-claims-discrepancy-in-clearances-in-nicobar-project-101724782551657.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9186897873878479
                },
                "image": "",
                "summary": "Congress leader Jairam Ramesh on Tuesday responded to Union environment minister Bhupender Yadav’s letter which said that no objections were raised by the tribal communities against the Great Nicobar project during the “statutory period” for such feedback, flagging several discrepancies with the process followed to accord environmental and forest clearances to the project.\nThe Shompen policy explicitly calls for priority to be given to the “integrity” of the community,” Ramesh said.\nWhy were his comments, opinions of the Shompen and Great Nicobarese Tribes, not considered by the Committee?\nThe standard that the Ministry should uphold is that forest cover on Andaman and Nicobar should be ‘totally safeguarded,’” Ramesh said.\nHe said the EIA appears to have been primed to ensure clearance of the project in the form proposed by the NITI Aayog."
            },
            {
                "description": "The Assam government seeks ex-post facto clearance for illegal forest land diversions and requests leniency for former PCCF MK Yadava, who approved the diversions.",
                "link": "https://www.hindustantimes.com/india-news/police-battalions-in-assam-s-forests-may-be-regularised-101724782551804.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8134516477584839
                },
                "image": "",
                "summary": "The Forest Advisory Committee considered the two contentious proposals among others on Tuesday.\nThese forests have already been diverted and most constructions have come up.\nIn 2023, MK Yadava, the then principal chief conservator of forests and head of the forest force in Assam, approved the construction of these commando battalions without prior forest clearance under the Forest Conservation Amendment Act.\nThereafter environment and RTI activist, Rohit Choudhary filed an application in NGT’s eastern bench against illegal diversion of forest land at Geleky Reserved Forest.\nIf the MoEFCC routinely regularises such fait accompli projects, it risks eroding the Ministry’s own credibility and the authority of the law itself."
            }
        ]
    },
    {
        "candidate": "Kiren Rijiju",
        "constituency": "ARUNACHAL WEST",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Graduate Professional",
        "totalAssets": "Rs 4,94,03,234 ~ 4 Crore+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "ARUNACHAL WEST (ARUNACHAL PRADESH)",
        "Profession": "Social Service",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/ee1c13ee6eb119882281bcbe152e67a2cc5ac4d4.jpg",
        "news": [
            {
                "description": "The official website of the Olympics confirms that no Indian cyclist competed in the cycling events in Berlin in 1936, while no Olympic games were held in 1942.",
                "link": "https://theprint.in/opinion/cyclist-jankidas-never-represented-india-at-olympics-the-flag-story-isnt-true/2241196/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7500768899917603
                },
                "image": "https://static.theprint.in/wp-content/uploads/2024/08/Feature-Image-1.jpg",
                "summary": "There is, however, a story involving a Congress flag—rather than the Indian flag—connected with Mehra.\nThe National Gandhi Museum in Delhi has on display an old Congress flag with a charkha (spinning wheel) in the centre.\nHowever, it should be noted that there is no signature of Gandhi on the flag displayed at the National Gandhi Museum.\nHowever, claiming it as the “first in 150 years” is factually incorrect, as the Indian flag was first introduced in 1906.\nHe added, “Suffice it to say, Jankidas has yet to compete in any open cycling event in India…” (Times of India, 28 October 1938, page 17)."
            },
            {
                "description": "Get latest articles and stories on India at LatestLY. Uttarakhand Chief Minister Pushkar Singh Dhami attended the Bharatiya Janata Party's United Front Workshop and Membership Campaign 2024 in Dehradun.",
                "link": "https://www.latestly.com/agency-news/india-news-uttarakhand-cm-dhami-attends-bjps-united-front-workshop-and-membership-campaign-in-dehradun-6223251.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9206228852272034
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2024/08/ANI-20240828174622-588x441.jpg",
                "summary": "Dehradun (Uttarakhand) [India], August 28 (ANI): Uttarakhand Chief Minister Pushkar Singh Dhami attended the Bharatiya Janata Party's United Front Workshop and Membership Campaign 2024 in Dehradun.\nOn this occasion, CM Dhami said, \"I have full faith that the nectar-like conclusion that will emerge from the brainstorming in this meeting will strengthen the organization.\"\nAlso Read | 'Rising Rajasthan' Global Investment Summit 2024: Rajasthan To Hold First Roadshow for Investment Summit in Mumbai on August 30.\nEarlier on Wednesday, BJP Minority Morcha organised a national membership campaign workshop 2024 at the BJP headquarters in Delhi to make the membership campaign 2024 successful.\nThe workshop was inaugurated by Union Minister Minority Affairs and Parliamentary Affairs Kiren Rijiju by paying floral tributes to Pandit Deendayal Upadhyay and Shyama Prasad Mukherjee."
            },
            {
                "description": "In recent years, there has been a marked reduction in the number of Bills referred to Parliamentary Standing Committees or Select Committees for thorough scrutiny, he says in letter to J.P. Nadda",
                "link": "https://www.thehindu.com/news/national/delay-in-forming-standing-committees-has-profound-implications-for-democratic-process-derek-o-brien/article68577293.ece",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8020631670951843
                },
                "image": "https://th-i.thgim.com/public/incoming/3746n/article68564935.ece/alternates/LANDSCAPE_1200/IMG_DERK_O_BRIEN_PRESS_C_2_1_8VCITRA4.jpg",
                "summary": "Trinamool Congress’s Rajya Sabha leader Derek O’Brien, in a letter to the leader of the House J.P. Nadda, complained about the delay in constitution of Department-related Parliamentary Standing Committees.\nThe department-related Standing Committees are an essential part of the parliamentary oversight mechanism.\nMr. O’ Brien said that the delay in the constitution of these committees has profound implications for the democratic process.\nAllow me to point out that in recent years, there has been a marked reduction in the number of Bills referred to Parliamentary Standing Committees or Select Committees for thorough scrutiny,” he added.\nSince DPSCs [Department-related Parliamentary Standing Committees] give more time for members to discuss important matters, the members are eager to start with the same,” he said."
            },
            {
                "description": "The BJP Minority Morcha organised a national membership campaign workshop 2024 at the party headquarters to make the membership campaign 2024 successful.",
                "link": "https://www.ndtv.com/india-news/how-bjps-minority-front-plans-to-enroll-50-lakh-members-6436053",
                "sentiment": {
                    "label": "positive",
                    "score": 0.5954253077507019
                },
                "image": "https://c.ndtvimg.com/2024-06/kvvcg99_bjp-generic_625x300_09_June_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
                "summary": "The Minority Morcha has a target of making 50 lakh members across the country.\nSimilarly, 22 lakh minority sisters connected with the \"Shukriya Modi Ji\" campaign and \"Modi Mitr\" will also join this campaign.\nBJP Minority Morcha national chief Jamal Siddiqui told ANI, \"Today, workers from BJP Minority Morcha from across the country have gathered at the BJP headquarters.\nWe aim to make around 50 lakh members from the minority community across the country.\nI believe we will exceed our first target of 50 lakh members."
            }
        ]
    },
    {
        "candidate": "Hardeep Puri",
        "news": [
            {
                "description": "Petroleum and Natural Gas Minister, Hardeep Singh Puri yesterday met Brazil’s External Affairs Minister, Mauro Vieira in New Delhi. In a social media post, Mr Puri said that he had a productive disc...",
                "link": "http://www.en.etemaaddaily.com/world/national/hardeep-singh-puri-brazils-mauro-vieira-discuss-energy-partnership-biofuels-collaboration:159937",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7838208675384521
                },
                "image": "https://www.en.etemaaddaily.com/pages/world/national/5810puri.jpeg",
                "summary": "Petroleum and Natural Gas Minister, Hardeep Singh Puri yesterday met Brazil’s External Affairs Minister, Mauro Vieira in New Delhi.\nIn a social media post, Mr Puri said that he had a productive discussion with Mr Vieira on taking forward the vibrant energy partnership between India and Brazil encompassing bilateral hydrocarbon trade.\nThey also held discussions on Indian investments in Brazil’s upstream sector and collaborative efforts in energy transition especially in the area of biofuels.\nMr Puri welcomed Brazil’s consistent and steadfast support for the Global Biofuels Alliance since its launch.\nHe highlighted that with Hungary joining the GBA, it has now expanded to 25 countries and 12 international organisations as members."
            },
            {
                "description": "Santosh Rao of Manhattan Venture Partners discusses the demand for skilled and unskilled workers in the US and Canada. He highlights the strain on local infrastructure and educational systems due to immigration. Rao emphasizes the need for balanced immigration policies amidst economic challenges and an undercurrent of xenophobia in some Western countries.",
                "link": "https://economictimes.indiatimes.com/nri/work/canadas-planned-cap-on-low-wage-foreign-workforce-a-temporary-pause-they-need-people-to-grow-their-gdp-santosh-rao/articleshow/112854685.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8834583163261414
                },
                "image": "https://img.etimg.com/thumb/msid-112856861,width-1200,height-630,imgsize-2401364,overlay-etnri/photo.jpg",
                "summary": "Synopsis Santosh Rao of Manhattan Venture Partners discusses the demand for skilled and unskilled workers in the US and Canada.\nSantosh Rao: I think overall it is a temporary pause, if anything.\nSantosh Rao: Yes.\nSantosh Rao: Yes, that risk is still there and it is growing because unemployment is there.\nSantosh Rao: We have seen that in every slowdown, the wrong people get blamed."
            }
        ]
    },
    {
        "candidate": "Mansukh Mandaviya",
        "constituency": "PORBANDAR",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Doctorate",
        "totalAssets": "Rs 7,95,04,705 ~ 7 Crore+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "PORBANDAR (GUJARAT)",
        "Profession": "Social Activist, Agriculture, Business",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/715ecec268137c40ff2f1f887104d3003ed204aa.jpg",
        "news": [
            {
                "description": "Get latest articles and stories on Sports at LatestLY. On the occasion of the National Sports Day on Thursday, legendary hockey player Major Dhyan Chand's son, Olympian Ashok Kumar unveiled his father's statue in Jabalpur, Madhya Pradesh.",
                "link": "https://www.latestly.com/agency-news/sports-news-olympian-ashok-kumar-unveils-major-dyan-chands-statue-on-national-sports-day-6223631.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.606043815612793
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2024/08/ANI-20240829035116-588x441.jpg",
                "summary": "Jabalpur (Madhya Pradesh) [India], August 29 (ANI): On the occasion of the National Sports Day on Thursday, legendary hockey player Major Dhyan Chand's son, Olympian Ashok Kumar unveiled his father's statue in Jabalpur, Madhya Pradesh.\nHe was felicitated with the Padma Bhushan in 1956 and his birth anniversary on August 29, is celebrated as National Sports Day.\nAlso Read | National Sports Day of India 2024 Date and Significance: Know All About the Day That Marks the Birth Anniversary of Hockey Legend Major Dhyan Chand.\nAlso Read | National Sports Day 2024 Wishes and HD Images: WhatsApp Messages, Wallpapers and Quotes for Celebrating the Importance of Sports and Physical Fitness.\nThe children who come here will get a new direction and inspiration...\" Ashok Kumar said while speaking to ANI."
            },
            {
                "description": "Essay on National Sports Day in English: 10 Lines, Short and Long Essay Ideas Jagran JoshNational Sports Day 2024: 10 inspiring sports autobiographies you must read The Indian ExpressIndian sporting fraternity honours Major Dhyan Chand on National Sports Day India TodayManu Bhaker Reveals PM Narendra Modi's Words After Tokyo Olympics Heartbreak That Lifted Her Spirits.. NDTV SportsZafar Iqbal, Mansukh Mandaviya pay tributes to Dhyan Chand on National Sports Day The Times of India",
                "link": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPU3ZFVmNTZEowdnEwWkg0YmdKSzYwSzRrbk5pNF9DWlJjcUhKOURJQ1VSaTAyOXF0SWZoVFNsbUpkV1VpMDBobU1hclBPRlJrTVNIUDdmV3hMcGVhdWxCbGdUd2dUMjh4U0ZoTGkzX2hJandtMUJBYTBoOGtFS2gyVzcwM05ubVNFd2Y1WVJQTkcyQ1920gGaAUFVX3lxTE5rVmZzRmV2cHJEZ2kzajZzbmVlZEd1dHF6ZDJQN1BXbHlfYjlVS3FHM3VCRGRiTi1pMTFhNE1yWGstMk1WTzF4SDRCYVhqNzdaOWhGeXBKUkJpeFhzRC03SXA5azRYZ25HSFZ4UHcyRTgxVml2ZGxXamNTdGxFajN2ZXE5YTVHQmJwdWJnQ2RvenFCMW1YR2YzMFE?oc=5",
                "sentiment": {
                    "label": "positive",
                    "score": 0.6669376492500305
                },
                "image": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
                "summary": ""
            },
            {
                "description": "Here is a select list of stories to start the day",
                "link": "https://www.thehindu.com/news/morning-digest-august-29-2024/article68578645.ece",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8367882966995239
                },
                "image": "https://th-i.thgim.com/public/incoming/wlza2t/article68578423.ece/alternates/LANDSCAPE_1200/20240828291L.jpg",
                "summary": "The Minister’s assurance came during a round table meeting with the CTUs, where ten unions alleged that the Codes are in favour of big corporations.\nIndia, Russia sign working plan to handle emergencies India and Russia signed the working plan of the Joint Russian-Indian Commission on the Cooperation in the Field of Emergency Management for 2025-2026 on Wednesday (August 28, 2024).\nUnion Minister of State for Home Nityanand Rai and Kurenkov Aleksandr Vyacheslavovich, Minister of the Russian Federation for Civil Defence, Emergencies and Elimination of Consequences of Natural Disasters (EMERCOM of Russia) signed the agreement in Moscow.\nThe post on X, which features Haryana Chief Minister Nayab Singh Saini interacting with children at various social events, begins with a child saying, “Apki baar Saini sarkar (this time Saini government)”.\nOn Ukraine’s surprise incursion into Kursk The attack caught Moscow off-guard and raised questions of an intelligence failure."
            },
            {
                "description": "Ten Central Trade Unions demand restoration of old pension scheme, want government to convene Indian Labour Conference; Labour Minister seeks unions’ inputs on ELI schemes; BMS says informal sector needs help",
                "link": "https://www.thehindu.com/news/national/centre-offers-further-discussions-with-trade-unions-on-labour-codes/article68577799.ece",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8670451641082764
                },
                "image": "https://th-i.thgim.com/public/incoming/wlza2t/article68578423.ece/alternates/LANDSCAPE_1200/20240828291L.jpg",
                "summary": "Union Labour Minister Mansukh Mandaviya has agreed to hold further discussions on the implementation of the four Labour Codes with the Central Trade Unions, union leaders said on Wednesday.\nThe Minister’s assurance came during a round table meeting with the CTUs, where ten unions alleged that the Codes are in favour of big corporations.\nRead the Labour Codes with the Central Trade Unions here Talking to reporters after the meeting, Mr. Mandaviya said that detailed discussions were held on the ELI schemes, which are projected to create two crore jobs in the country.\n“We have raised a host of issues including the implementation of Labour Codes.\nThe Minister said he is ready for further discussions on Labour Codes,” All India Trade Union Congress general secretary Amarjeet Kaur said."
            },
            {
                "description": "At the first roundtable meeting with the minister, since he took charge in June, the 10 central trade unions submitted a joint demand charter to the minister asking government to immediately convene the Indian Labour Conference, scrap the Labour Codes and start dialogue in ILC for changes in laws to the satisfaction of all concerned, and immediate halting of privatisation across sectors.",
                "link": "https://economictimes.indiatimes.com/news/india/labour-minister-mansukh-mandaviya-seeks-view-of-trade-unions-on-employment-linked-incentive-schemes/articleshow/112871736.cms",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8924900889396667
                },
                "image": "https://img.etimg.com/thumb/msid-112871735,width-1200,height-630,imgsize-30124,overlay-economictimes/photo.jpg",
                "summary": "Labour and employment minister Mansukh Mandaviya, on Wednesday, sought the view of all central trade unions on the proposed employment-linked incentive (ELI) scheme announced in the Budget as the ministry firms up the three schemes to be implemented through the Employees Provident Fund Organisation.\nAccording to the statement, minister Mansukh Mandaviya also assured trade unions that there will be regular meetings between the two sides to discuss various issues going forward.\nThe central trade unions submitted a joint representation to the minister while seeking more clarity on the employment linked incentive scheme.\n(You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)\n...moreless (You can now subscribe to our Economic Times WhatsApp channel) (Catch all the Business News, Breaking News, Budget 2024 Events and Latest News Updates on The Economic Times.)"
            },
            {
                "description": "Get latest articles and stories on Latest News at LatestLY. Union Labour Minister Mansukh Mandaviya on Wednesday assured trade unions that there will be regular meetings between the two sides to discuss various issues, including employment-linked incentive scheme, which was discussed at length here.",
                "link": "https://www.latestly.com/agency-news/latest-news-mandaviya-assures-unions-of-regular-meetings-to-seek-input-on-schemes-policies-6222716.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8702695369720459
                },
                "image": "https://st1.latestly.com/wp-content/uploads/2020/10/news-default-img-784x441.jpg",
                "summary": "New Delhi, Aug 28 (PTI) Union Labour Minister Mansukh Mandaviya on Wednesday assured trade unions that there will be regular meetings between the two sides to discuss various issues, including employment-linked incentive scheme, which was discussed at length here.\nThe employment-linked incentive scheme was announced by Finance Minister Nirmala Sitharaman while presenting the Union Budget 2024-25 in Parliament on July 23, 2024.\nMandaviya on Wednesday had a round table meeting with representatives of the central trade unions to understand their views on various labour issues.\nA joint representation was submitted by the platform of central trade unions to Mandaviya, said a joint statement by a forum of 10 central trade unions.\nThe ministry itself said the scheme is still in the making and they are beginning discussions to seek stakeholders' views, it stated."
            },
            {
                "description": "India's Infosys recruits reportedly subjected to repeated, unpaid \"pre-training.\" - arstechnica.com",
                "link": "https://news.knowledia.com/all/all/articles/exploitative-it-firm-has-been-delaying-2-000-recruits-onboarding-for-2a21b10d1c91f7f88d3c34d6b979d2607e861a60?source=rss",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.5627045035362244
                },
                "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/GettyImages-146180588-760x380.jpg",
                "summary": "a day ago arstechnica.com 4 min read fairly difficult India's Infosys recruits reportedly subjected to repeated, unpaid \"pre-training.\"\nThe recent graduates have reportedly been told they must do repeated, unpaid training in order to remain eligible to work at Infosys.\nUnpaid \"pre-training\" NITES claims the people sent job offers were asked to participate in an unpaid, virtual \"pre-training\" that took place from July 1, 2024, until July 24, 2024.\nInfosys' HR team reportedly told the recent graduates at that time that onboarding plans would be finalized by August 19 or September 2.\nBut things didn't go as anticipated, NITES' letter claimed, leaving the would-be hires with \"immense frustration, anxiety, and uncertainty.\""
            },
            {
                "description": "India's Infosys recruits reportedly subjected to repeated, unpaid \"pre-training.\"",
                "link": "https://arstechnica.com/?p=2045697",
                "sentiment": {
                    "label": "negative",
                    "score": 0.657223641872406
                },
                "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/GettyImages-146180588-760x380.jpg",
                "summary": "Indian IT firm Infosys has been accused of being “exploitative” after allegedly sending job offers to thousands of engineering graduates but still not onboarding any of them after as long as two years.\nThe recent graduates have reportedly been told they must do repeated unpaid training in order to remain eligible to work at Infosys.\nInfosys' HR team reportedly told the recent graduates at that time that onboarding plans would be finalized by August 19 or September 2.\nInfosys hasn’t explained why the onboarding of thousands of recruits has taken longer to begin than expected.\nA June 2024 study of Indian hiring trends [PDF] reported that IT job hiring in hardware and network declined 9 percent year over year, and hiring in software and software services declined 5 percent year over year."
            }
        ]
    },
    {
        "candidate": "Kishan Reddy",
        "constituency": "SECUNDERABAD",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Others",
        "totalAssets": null,
        "liabilities": null,
        "details__constituency": "SECUNDERABAD (TELANGANA)",
        "Profession": "Social Service",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/969091a0758f3cbb6559fc6aa13c7b741cb23ea8.jpg",
        "news": [
            {
                "description": "Indian cricket team players are expected to participate in the tournament.",
                "link": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/anantapur-to-host-duleep-trophy-from-sept-5-1819791",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8556873798370361
                },
                "image": "https://www.deccanchronicle.com/h-upload/2024/08/28/1835146-duleep-trophy.webp",
                "summary": "Anantapur:After a long gap of 62 years, Anantapur will be hosting the Duleep Trophy cricket matches at the RDT Cricket Stadium in the Ananta Sports Village from September 5 to September 22.\nSources said at least eight members of the Indian cricket team are expected to play for either the India A, India B, India C, or India D teams.\nThe RDT stadium, which is on the outskirts of Anantapur city, can accommodate 4,000 spectators in its galleries.\nThey are planning to issue passes to students of various schools, so that they can cheer for the four teams.\nAdditional security will be deployed in and around the stadium and at hotels, where the cricketers will be staying."
            },
            {
                "description": "Hyderabad: Zaheerabad in Sangareddy district has been picked by the Centre as one of the 12 industrial smart cities in 10 states that are being developed at a cost of Rs 28,602 crore. The decision has been taken during a Union cabinet meeting in Delhi on Wednesday, August 28. The smart industrial city is being ...Get the latest updates in Hyderabad City News, Technology, Entertainment, Sports, Politics and Top Stories on WhatsApp & Telegram by subscribing to our channels. You can also download our app for Android and iOS.",
                "link": "https://www.siasat.com/centre-to-develop-zaheerabad-nimz-as-smart-industrial-city-3086531/",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.7182099223136902
                },
                "image": "https://cdn.siasat.com/wp-content/uploads/2023/12/Untitled-design-2023-12-20T155942.872.jpg",
                "summary": "Hyderabad: Zaheerabad in Sangareddy district has been picked by the Centre as one of the 12 industrial smart cities in 10 states that are being developed at a cost of Rs 28,602 crore.\nThe smart industrial city is being seen as a revival of the National Investment and Manufacturing Zone (NIMZ) that was established in Zaheerabad in 2013 during the earlier Congress-led United Progressive Alliance (UPA) under the National Industrial Corridor Development Programme by the Centre presently.\nA total 12,500 acres which has been designated for NIMZ/smart industrial city.\nUnion coal and mines minister G Kishan Reddy thanked Prime Minister Narendra Modi and Union industries minister Piyush Goyal for designating NIMZ as one of the prestigious industrial smart cities in the country.\nZaheerabad MP Suresh Shetkar thanked Chief Minister A Revanth Reddy for representing to the Centre for including Zaheerabad under the smart industrial cities programme."
            },
            {
                "description": "NLC India signs 25-year agreement with Telangana for 200 MW solar power CNBCTV18NLC India signs power usage agreement to supply 200 MW green power; shares up 3% MoneycontrolNLC India signs deal with discoms in T The Times of IndiaCentre urges state to sign PPA with NLC’s Gujarat unit The New Indian ExpressNLC ready to provide 200 MW solar power to TG: Kishan Reddy The Hindu",
                "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPd3RHNUVCVi12UWxCSGJra2pGV0FwZkVYQzBoM1MzZTdRelFFakFkN2lCaWdNTUgtd3hTWVdSZWxUY0Q5WnlrZWFwa0xSbHZ2Q196YWVPUnhxOC0wYmw4OElvS3NrbnczZGJoSDZtdWx1MGtRTFFvTGR4MkFHdlZYcFRISGFGOVl3MURrVE5HN3pmVThBSTNIa0c4aW1GalB3Y1pTa2JuX0pFdmxib2RhbUdlZWJBWkRrd2JxUERoUXnSAcYBQVVfeXFMUHZJT2M2TTN3NDRCVXgxRkRtemhCemUzU2JNYWVsVFc3bGZPQWlfRmw4Mmw1RzhzbEVyWnZtYk9vTkNwbWo4cGxvMEpHYUkxRk5nLTVzM3RXbUxPYjRsOW5WSTMzVF9uS096ajBNdWoyRFBHZi1FYVEzdFF0RTdKUE1NZmxmM0dYQk01Y0RGTnVva2RkUDFaWnRHcWtuREZDczZIMXA2TFJRN2xuUUR1c05TVDJOLXRLMnI3QjJ0Qm5KV2FfaDVR?oc=5",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8973179459571838
                },
                "image": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
                "summary": ""
            },
            {
                "description": "Union Coal Minister G Kishan Reddy on Wednesday thanked Prime Minister Narendra Modi for announcing Zaheerabad as Industrial Smart City. The Cabinet Committee on Economic Affairs (CCEA) chaired b...",
                "link": "http://www.en.etemaaddaily.com/world/hyderabad/kishan-reddy-thanks-modi-for-announcing-zaheerabad-as-industrial-smart-city:159976",
                "sentiment": {
                    "label": "positive",
                    "score": 0.6733234524726868
                },
                "image": "https://www.en.etemaaddaily.com/pages/world/hyderabad/684un(99).jpg",
                "summary": "Union Coal Minister G Kishan Reddy on Wednesday thanked Prime Minister Narendra Modi for announcing Zaheerabad as Industrial Smart City.\nThe Cabinet Committee on Economic Affairs (CCEA) chaired by Modi has approved the setting up of 12 new Industrial Smart Cities.\nApproval was done under the National Industrial Corridor Development Programme (NICDP) with an estimated investment of Rs.\n28,602 crore."
            },
            {
                "description": "Union Minister of Coal and Mines, G Kishan Reddy said that the Coal Ministry has taken a step forward in the ongoing effort to meet the future electricity needs of Telangana.",
                "link": "https://www.thehansindia.com/telangana/nlc-solar-plant-can-provide-200-mw-green-electricity-annually-to-state-kishan-902790",
                "sentiment": {
                    "label": "positive",
                    "score": 0.539466917514801
                },
                "image": "https://assets.thehansindia.com/h-upload/2024/08/28/1475146-solar.jpg",
                "summary": "Due to this, NLC (Neyveli Lignite Corporation) India Ltd. has agreed to provide 200 megawatts of solar energy (solar power) to Telangana annually.\nKutch has as much land and a favourable climate, as required for solar power.\nThe works of the solar power plant, which is being built at a cost Rs 1,214 crore are almost complete.\nThe project will become crucial in meeting the electricity needs of Telangana and the electricity is available at Rs 2.57/kWh through this solar project.\nAnother important feature of this solar project is that all the solar cells used in this project will be used domestically to boost the 'Make in India' goal."
            }
        ]
    },
    {
        "candidate": "Chirag Paswan",
        "constituency": "HAJIPUR (SC)",
        "party": "Lok Janshakti Party(Ram Vilas)",
        "criminalCase": 0,
        "education": "12th Pass",
        "totalAssets": "Rs 2,68,75,873 ~ 2 Crore+",
        "liabilities": "Rs 0 ~",
        "details__constituency": "HAJIPUR (SC) (BIHAR)",
        "Profession": "Member of Parliament",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/daf2c0c9ba8ef46c11e015de2b70cc7b71b2bf4b.jpg",
        "news": [
            {
                "description": "A census to enumerate castes is likely to unravel the BJP's project to unify the Hindus and build a Hindu Rashtra.",
                "link": "https://www.thequint.com/opinion/caste-census-rahul-gandhi-politics-opposition-congress-bjp-modi-hindutva-nda-chirag-paswan",
                "sentiment": {
                    "label": "negative",
                    "score": 0.6041218042373657
                },
                "image": "https://images.thequint.com/thequint%2F2024-08-28%2Fk951b3mi%2FScreenshot%202024-08-28%20at%2020.26.32.png",
                "summary": "We (the Opposition) will make sure that the bill (for a caste census) is passed here.\"\nHaving thrown down the gauntlet so aggressively, Rahul may well have catalysed a return to caste politics as a counter to the BJP’s Hindutva.\nEverything failed till he stepped out of the Congress' comfort zone with a Bharat Jodo Yatra that prompted him to embrace caste politics with both arms.\nRahul’s decision to go full throttle with a demand for a caste census would seem to go against the grain.\nSince the temple was the cutting edge of the BJP’s Hindutva politics, populist majoritarian nationalism is losing steam."
            },
            {
                "description": "GV Harsha Kumar, Ex-MP and convenor of the Anti-Classification Struggle Committee made notable remarks about the classification of SC reservations in a media briefing on Wednesday.",
                "link": "https://www.thehansindia.com/andhra-pradesh/harsha-kumar-predicts-madiga-leaders-will-soon-oppose-sc-reservation-classification-902883",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.9152783751487732
                },
                "image": "https://assets.thehansindia.com/h-upload/2024/08/28/1475258-harsha-kumar.jpg",
                "summary": "RAJAMAHENDRAVARAM: GV Harsha Kumar, Ex-MP and convenor of the Anti-Classification Struggle Committee made notable remarks about the classification of SC reservations in a media briefing on Wednesday.\nHe predicted that members of the Madiga community, who previously fought for SC reservation classification, would soon oppose it.\nHarsha Kumar expressed concerns that the implementation of the classification, under the guise of the \"Creamy Layer\" concept, could endanger the entire reservation system.\nHarsha Kumar firmly opposed the Supreme Court's ruling on the SC reservations classification matter, describing it as unconstitutional, and mentioned that a review petition had been filed by him.\nHarsha Kumar demanded the government pay the outstanding fees of ₹100 crores owed to his college and criticized both Chief Ministers N. Chandrababu Naidu (2014-2019) and YS Jagan Mohan Reddy (2019-2024) for increasing arrears during their tenures."
            }
        ]
    },
    {
        "candidate": "Chandrakant Patil",
        "constituency": "NAVSARI",
        "party": "BJP",
        "criminalCase": 0,
        "education": "Others",
        "totalAssets": "Rs 39,49,30,044 ~ 39 Crore+",
        "liabilities": "Rs 2,75,82,988 ~ 2 Crore+",
        "details__constituency": "NAVSARI (GUJARAT)",
        "Profession": "Business, Agriculture, MP",
        "photo": "https://myneta.info/images_candidate/mynetai_ews5LokSabha2024/005c96028d2744df1aef1b2d47ea21728e0e655b.jpg",
        "news": [
            {
                "description": "Mr. Kesarkar has come under a lot of flak from the opposition, which has demanded his sacking. Shiv Sena (UBT) chief Uddhav Thackeray hit out at him saying, “This means a new tender will be floated to build a new structure and there will be a scam again”",
                "link": "https://www.deccanchronicle.com/news/politics/kesarkar-says-his-something-good-will-come-out-statement-was-misinterpreted-1819771",
                "sentiment": {
                    "label": "negative",
                    "score": 0.680662214756012
                },
                "image": "https://www.deccanchronicle.com/h-upload/2024/08/28/1835120-kesarkar.webp",
                "summary": "Mumbai: Maharashtra minister Deepak Kesarkar has landed in controversy over his statement “something good will come out” on the Chhatrapati Shivaji Maharaj statue collapse.\nClarifying his remark, Mr. Kesarkar said he never said that the incident of statue collapse was good.\nMr. Kesarkar has come under a lot of flak from the opposition, which has demanded his sacking.\nBesides, Mr. Kesarkar has made a statement that only exposes the shoddy functioning of the Mahayuti government,” he said.\nSlamming Mr. Kesarkar, he said, “People like Mr. Kesarkar belong to Devendra Fadnavis’s team."
            },
            {
                "description": "As Maharashtra prepares for assembly elections, political leaders in Pune are turning to religious tourism as a means to connect with voters",
                "link": "https://www.hindustantimes.com/cities/pune-news/ahead-of-assembly-polls-politicians-wooing-voters-with-free-religious-tours-101724785281353.html",
                "sentiment": {
                    "label": "neutral",
                    "score": 0.8886328339576721
                },
                "image": "",
                "summary": "While the primary focus is on religious destinations, some tours involve historical and cultural landmarks.\nThe practice was popularised in Pune by Congress corporator, Aba Bagul, who began organising these trips nearly 23 years ago.\n“I have been organising these trips for over two decades, and I hope others don’t see them merely as an election tactic.\nDilip Vede Patil, a BJP candidate, recently organised a trip to Bhimashankar during the auspicious (ongoing) month of Shravan.\nA senior political leader on condition of anonymity said that more than 30 to 35 politicians in Pune are currently organising such trips."
            }
        ]
    }
]